{
  "metadata": {
    "export_date": "2025-05-28T19:01:44.242899",
    "source_database": "zodiac.db",
    "total_tables": 11,
    "description": "Астрологическая база данных - планеты в знаках зодиака",
    "total_records": 132
  },
  "tables": {
    "Солнце": {
      "structure": {
        "columns": [
          "id",
          "zodiac_sign",
          "description"
        ],
        "total_records": 12
      },
      "data": [
        {
          "id": 1,
          "zodiac_sign": "Овен",
          "description": "Солнце символизирует жизненную силу и творчество. Оно управляет чувством идентичности и проливает свет на природу человека и его ценности, которых вы придерживаетесь (Солнечный знак и есть основной знак зодиака, про который люди спрашивают друг друга прежде всего).\n\nОвны — люди с огромной энергией и энтузиазмом, которые активно используют их для достижения своих целей. Они стремятся к лидерству и всегда готовы проявить свои способности, однако могут быть нетерпеливы, упрямы и даже агрессивны. Их энергия обычно направлена на запуск новых проектов, но довести их до конца оказывается главной трудностью, с которой могут столкнуться представители данного знака. Будучи достаточно эгоистичными натурами, Овны склонны действовать самостоятельно, поэтому сотрудничество с другими является важным шагом для улучшения результатов. Овнам следует развивать терпение, самоконтроль и дисциплину, а также рационально распределять энергию."
        },
        {
          "id": 2,
          "zodiac_sign": "Телец",
          "description": "Солнце символизирует жизненную силу и творчество. Оно управляет чувством идентичности и проливает свет на природу человека и его ценности, которых вы придерживаетесь (Солнечный знак и есть основной знак зодиака, про который люди спрашивают друг друга прежде всего).\n\nПро Тельцов можно сказать, что они люди медлительные, зато стабильные и надёжные. Они умеют доводить начатые дела до конца и являются исключительно надёжными партнерами. Хотя Тельцам бывает сложно самостоятельно начать что-то новое, в команде они — ценное и ответственное звено. Терпеливые по натуре, Тельцы могут стать крайне агрессивными и неуправляемыми, если их терпение иссякнет. В такие моменты лучше дать им время успокоиться, избегая давления. Представители данного знака редко меняют свои убеждения. В кризисных ситуациях Тельцы сохраняют хладнокровие и подходят к проблемам с практической точки зрения. Ценя красоту и гармонию, они также сталкиваются с внутренним страхом потери чего-то или кого-то. Это может приводить к проявлению таких черт, как собственничество, ревность, лень, упрямство. Тельцам важно развивать свои умственные и духовные способности и преодолевать свое желание все контролировать."
        },
        {
          "id": 3,
          "zodiac_sign": "Близнецы",
          "description": "Солнце символизирует жизненную силу и творчество. Оно управляет чувством идентичности и проливает свет на природу человека и его ценности, которых вы придерживаетесь (Солнечный знак и есть основной знак зодиака, про который люди спрашивают друг друга прежде всего).\n\nСолнечные Близнецы отличаются дружелюбием, острым умом и природной любознательностью. Обладая развитой интуицией и логическим мышлением, они тянутся к новым знаниям и опыту. Часто представители данного знака, занимаясь несколькими делами одновременно, могут не укладываться в установленные сроки. Близнецы терпеть не могут скуку и постоянно ищут интеллектуальной стимуляции. Их быстрый ум и хорошее чувство юмора позволяют им легко адаптироваться к ситуациям. Однако Близнецы могут быть нетерпеливы и очень критичны как к себе, так и к окружающим. Несмотря на способность решать задачи мгновенно, Близнецы иногда склонны колебаться между разными точками зрения, что делает их нерешительными. "
        },
        {
          "id": 4,
          "zodiac_sign": "Рак",
          "description": "Солнце символизирует жизненную силу и творчество. Оно управляет чувством идентичности и проливает свет на природу человека и его ценности, которых вы придерживаетесь (Солнечный знак и есть основной знак зодиака, про который люди спрашивают друг друга прежде всего).\n\nСолнечные Раки обладают острой наблюдательностью и часто проявляют нерешительность. Им требуется время для принятия решений, так как они склонны глубоко переживать и пропускать через себя все эмоциональные колебания окружающего мира. Их настроение изменчиво, что может осложнять общение с ними. Представители этого знака особенно ценят уют и безопасность, которые находят в семье. Они нуждаются в безусловной любви и внимании близких и испытывают разочарование, если этого не получают. Ракам необходимо научиться отпускать дорогих людей и давать им свободу и независимость."
        },
        {
          "id": 5,
          "zodiac_sign": "Лев",
          "description": "Солнце символизирует жизненную силу и творчество. Оно управляет чувством идентичности и проливает свет на природу человека и его ценности, которых вы придерживаетесь (Солнечный знак и есть основной знак зодиака, про который люди спрашивают друг друга прежде всего).\n\nСолнечные Львы обладают следующими ярко выраженными качествами — гордостью, смелостью, силой, щедростью, жизнерадостностью и оптимизмом. Они амбициозны и стремятся к лидерству и творческому самовыражению. Львы любят быть на виду, привлекать внимание. Внешне они кажутся сильными и уверенными, но внутри часто бывают чувствительными и легко ранимыми. Среди их негативных черт — требовательность, нетерпеливость, склонность к деспотизму и самовлюблённость, а также невосприимчивость к критике и чужому мнению. Задетая гордость может вызывать у Льва вспышки агрессии, однако они быстро прощают и забывают обиды. Щедрость Льва не знает границ — он легко тратит деньги, редко задумываясь о последствиях. Обычно представители этого знака обладают крепким здоровьем, однако склонны к проблемам с сердечно-сосудистой системой в период стресса или депрессии. Львам особенно нужны нуждаются восхищение и признание от партнёров."
        },
        {
          "id": 6,
          "zodiac_sign": "Дева",
          "description": "Солнце символизирует жизненную силу и творчество. Оно управляет чувством идентичности и проливает свет на природу человека и его ценности, которых вы придерживаетесь (Солнечный знак и есть основной знак зодиака, про который люди спрашивают друг друга прежде всего).\n\nСолнечные Девы стремятся к чистоте, порядку и совершенству во всех сферах жизни. Они сдержанны, скромны и обладают аналитическим складом ума. Точность, трудолюбие, тактичность, пунктуальность и надёжность — их главные достоинства. Девы наблюдательны и внимательны, всегда выполняют свои обязанности на высоком уровне. Однако среди отрицательных черт можно выделить склонность к придирчивости, язвительности, скептицизму, пессимизму и иногда эгоцентричности. Девы предпочитают работу, которая требует внимания к мелочам и направлена на помощь другим. Им не важна власть — они ценят полезность и практичность выше лидерства. Любопытство и отличная память делают их превосходными аналитиками. Девы ненавидят бездействие и всегда находят себе занятие. Ответственность — основа их характера, и они часто организуют свою жизнь через списки, графики и чётко продуманные проекты. В своём стремлении к совершенству они могут ожидать того же от окружающих. Частое беспокойство и напряжение могут негативно сказаться на их здоровье, особенно на работе желудочно-кишечного тракта. Для поддержания баланса Девам важно развивать позитивное мышление. В отношениях они могут испытывать сложности с выражением чувств, но при этом остаются преданными и внимательными партнёрами."
        },
        {
          "id": 7,
          "zodiac_sign": "Весы",
          "description": "Солнце символизирует жизненную силу и творчество. Оно управляет чувством идентичности и проливает свет на природу человека и его ценности, которых вы придерживаетесь (Солнечный знак и есть основной знак зодиака, про который люди спрашивают друг друга прежде всего). \n\nСолнечные Весы всегда стремятся взвесить все \"за\" и \"против\" перед тем, как принять решение, что порой приводит к затяжке этого процесса или вовсе к его отсутствию. Они ценят гармонию, баланс и справедливость, проявляют дипломатичность и легко находят общий язык с окружающими. Весы любят командную работу и стараются создавать вокруг себя комфортную, эстетически приятную атмосферу. В любви они романтичны и склонны к сентиментальности, что иногда может привести к поспешным бракам. Эмоциональная нестабильность и желание избежать конфликтов любой ценой делают их уязвимыми для манипуляций со стороны других людей. Весы стараются всем понравиться, часто откладывая принятие решений и упуская при этом крутые возможности. Они нередко испытывают трудности с отказом и склонны к прокрастинации, что мешает им действовать эффективно. Под влиянием сильных личностей Весы могут потерять свою уверенность. Так что представителям этого знака следует учиться отстаивать свои интересы и принимать решения, опираясь на собственные убеждения, а не на желания окружающих."
        },
        {
          "id": 8,
          "zodiac_sign": "Скорпион",
          "description": "Солнце символизирует жизненную силу и творчество. Оно управляет чувством идентичности и проливает свет на природу человека и его ценности, которых вы придерживаетесь (Солнечный знак и есть основной знак зодиака, про который люди спрашивают друг друга прежде всего).\n\nСимволами Солнечного Скорпиона являются орёл и скорпион, которые отражают две стороны его натуры. Орёл символизирует преодоление низших инстинктов и стремление к духовному возвышению, тогда как скорпион олицетворяет тех, кто живёт в страстях и соблазнах. Скорпионы отличаются амбициозностью, продуктивностью и смелостью. Они обладают находчивостью, острым умом и мощной интуицией, но при этом могут быть ревнивыми, саркастичными, злопамятными и упрямыми. Эти люди не боятся сложных задач, предпочитают интенсивные усилия и часто выбирают трудные пути для достижения своих целей. Их сила воли и умение глубоко анализировать позволяют Скорпионам выстраивать долгосрочные планы. В дружбе они верны и преданы, но скрытны, поэтому могут не всегда раскрывают свои истинные намерения. Они Самоотверженны и готовы жертвовать ради близких, однако могут склонны к потери самообладания при критике и мстительности. Интуиция Скорпионов помогает им тонко чувствовать мотивы окружающих, что делает их отличными психологами и стратегами. Самодостаточные, они редко ищут признания и одобрения со стороны. В любви Скорпионы преданны, ласковы и, одновременно, склонны к контролю над своим партнером из-за своего стремления к глубокой эмоциональной связи."
        },
        {
          "id": 9,
          "zodiac_sign": "Стрелец",
          "description": "Солнце символизирует жизненную силу и творчество. Оно управляет чувством идентичности и проливает свет на природу человека и его ценности, которых вы придерживаетесь (Солнечный знак и есть основной знак зодиака, про который люди спрашивают друг друга прежде всего).\n\nЛичности с Солнцем в Стрельце обладают ярко выраженным идеализмом, оптимизмом и жизнерадостностью. Они открыты, дружелюбны и честны. Они легко адаптируются к разным ситуациям, однако иногда проявляют бестактность, безответственность, хвастливость или самодовольство. Стрельцы склонны выбирать рискованные задачи, избегая монотонной и скрупулезной работы. Их прямолинейность и откровенность нередко воспринимаются как неумение учитывать чувства других людей. Любовь к природе, спорту и путешествиям тесно связана с их стремлением к свободе и новизне. Интерес к философским вопросам и вера в светлое будущее вдохновляют Стрельцов на самосовершенствование и поиск глубинного смысла жизни. Они энергичны, но часто подвержены истощению, поэтому им важно находить время для восстановления сил. Мелкие детали могут быстро наскучить Стрельцам, из-за чего они порой утрачивают интерес к проектам, требующим большого внимания. Тем не менее, их природное дружелюбие и чувство юмора привлекают людей, а желание помогать другим делает их надежными друзьями. Свободолюбивые и независимые, Стрельцы не терпят ограничений, будь то в личной жизни или на работе. В любви они романтичны и искренни, но ревность и попытки контролировать их вызывают у Стрельцов неприятие. В профессиональной сфере Стрельцы особенно успешны в областях, связанных с путешествиями и взаимодействием с людьми, где их жажда приключений и социальные навыки находят наилучшее применение."
        },
        {
          "id": 10,
          "zodiac_sign": "Козерог",
          "description": "Солнце символизирует жизненную силу и творчество. Оно управляет чувством идентичности и проливает свет на природу человека и его ценности, которых вы придерживаетесь (Солнечный знак и есть основной знак зодиака, про который люди спрашивают друг друга прежде всего).\n\nЛюди с Солнцем в Козероге известны своей независимостью и самодостаточностью, которые помогают им воплощать амбициозные цели и обеспечивать стабильность. Они склонны к консерватизму и отличаются высокой организованностью, методичностью, ответственностью и практичностью. Эти качества, вместе с дисциплиной и целеустремленностью, делают их надежными и устойчивыми на пути к успеху. Страх перед неудачей нередко заставляет Козерогов строить вокруг себя эмоциональные «стены», чтобы защитить свои планы и избежать уязвимости. Они относятся к работе с полной серьезностью, стремясь к профессиональному признанию и уважению. Некоторым Козерогам присущ комплекс неполноценности, который становится для них мощным стимулом для достижения высот. Их подход всегда тщательно спланирован, а в кризисных ситуациях они проявляют хладнокровие и надёжность. Для Козерогов особенно важны уважение и признание их достижений, и любое поощрение вдохновляет их на новые свершения. Они бережливы и умеют эффективно управлять как временем, так и ресурсами, избегая расточительности. Их терпение и стойкость позволяют им преодолевать любые препятствия, а преданность близким делает их верными друзьями и партнёрами. В любовных отношениях Козероги осторожны, предпочитая не торопиться с выражением чувств. Их сдержанность продиктована желанием защитить себя, однако, когда они находят человека, которому могут полностью довериться, их верность и забота не знают границ."
        },
        {
          "id": 11,
          "zodiac_sign": "Водолей",
          "description": "Солнце символизирует жизненную силу и творчество. Оно управляет чувством идентичности и проливает свет на природу человека и его ценности, которых вы придерживаетесь (Солнечный знак и есть основной знак зодиака, про который люди спрашивают друг друга прежде всего).\n\nК главным чертам Солнечных Водолеев можно отнести дружелюбие, оригинальность и свободомыслие. Их интуитивный способ познания мира и независимость помогают им не только стремиться к личной свободе, но и активно работать над улучшением жизни общества. Водолеи открыты новаторским идеям и часто являются источником креативных решений, однако их поведение иногда может быть непредсказуемым, а взгляды — упрямыми или даже радикальными. Предпочитая работу, где требуется изобретательность и инновации, Водолеи всегда ищут возможности делиться своими знаниями и помогать окружающим. Они сфокусированы на глобальных вопросах и могут казаться отстраненными от повседневных забот, но это лишь отражает их стремление видеть мир в более широком масштабе. Применяя новые идеи в рамках старых систем, они пользуются своим аналитическим мышлением, чтобы найти нестандартные решения для традиционных проблем. Не терпящие ограничений, Водолеи ценят свободу и легко адаптируются к правилам, когда это необходимо для достижения целей. В отношениях они ищут партнера, с которым можно установить глубокую интеллектуальную связь. Водолеи часто могут долго размышлять перед тем, как взять на себя серьезные обязательства, так как для них важно сохранять баланс между личной свободой и привязанностью."
        },
        {
          "id": 12,
          "zodiac_sign": "Рыбы",
          "description": "Солнце символизирует жизненную силу и творчество. Оно управляет чувством идентичности и проливает свет на природу человека и его ценности, которых вы придерживаетесь (Солнечный знак и есть основной знак зодиака, про который люди спрашивают друг друга прежде всего).\n\nРыбы отличаются сочувствием, состраданием, скромностью и богатой интуицией. Они идеалисты с глубоким духовным и эмоциональным миром, а их креативность позволяет им реализоваться в творчестве. При этом Рыбы могут быть впечатлительными, нерешительными и гиперчувствительными, что делает их уязвимыми к переменам настроения. Стремление служить другим и романтические идеалы в любви формируют их внутренний мир. Они легко впитывают информацию из окружения, обладая ярким воображением, но часто сомневаются в себе и нуждаются в поддержке. Рыбам важно научиться понимать свои эмоциональные колебания и верить в собственные силы. Щедрые и готовые помочь, они чувствуют себя лучше, когда могут быть полезны другим, но из-за своей доброты могут попасть под манипуляции. Из-за склонности жертвовать собой, они порой берут на себя роль мучеников или спасителей. Рыбы скрытны, но легко находят друзей и остаются им верны. Склонные к прокрастинации, они нуждаются в отдыхе для восстановления энергии. Утешение и вдохновение Рыбы часто находят в искусстве и музыке, где могут выразить свои глубокие чувства."
        }
      ]
    },
    "Асцендент": {
      "structure": {
        "columns": [
          "id",
          "zodiac_sign",
          "description"
        ],
        "total_records": 12
      },
      "data": [
        {
          "id": 1,
          "zodiac_sign": "Овен",
          "description": "Асцендент — градус зодиакального знака, который восходит над горизонтом в момент рождения человека. Он оказывает значительное влияние на внешние проявления личности и первое впечатление, которое человек производит на окружающих.\n\nЧеловек с Асцендентом в Овне появляется на свет стремительно, зачастую раньше срока. Он полон порывов, страсти и честности, но может казаться грубым и дерзким. Его внешность характеризуется резкими чертами лица и кустистыми бровями; глаза — каре-зеленые или ореховые, а волосы — каштановые. Предпочитает яркие цвета в одежде и ведет себя уверенно. Женщины с Асцендентом в Овне страстны и независимы, мужчины — лидеры и свободолюбивые искатели приключений, ценящие физическую активность и спорт."
        },
        {
          "id": 2,
          "zodiac_sign": "Телец",
          "description": "Асцендент — градус зодиакального знака, который восходит над горизонтом в момент рождения человека. Он оказывает значительное влияние на внешние проявления личности и первое впечатление, которое человек производит на окружающих.\n\nЧеловека, у которого Асцендент в Тельце, можно охарактеризовать как упорного труженика: упрямого, но добросердечного. Он стремится к гармонии между материальным и душевным комфортом. Внешне это округлый человек с пухлыми щеками и крупными чертами лица, мягкими волнистыми волосами, а глаза могут быть серыми, голубыми или зелеными. Женщины с Асцендентом в Тельце — лидеры и заботливые хозяйки, мужчины — лояльные и справедливые исполнители и начальники. Люди с Асцендентом в Тельце предпочитают стабильные доходы и комфорт. Они не любят менять обстановку и путешествовать. В любви такие личности не склонны к фантазиям и болезненно переживает измену, потому что сами остаются верными и надежными как в дружбе, так и в семье. Профессии для людей с Асцендентом в Тельце обычно связаны с логикой, математикой и практическим подходом."
        },
        {
          "id": 3,
          "zodiac_sign": "Близнецы",
          "description": "Асцендент — градус зодиакального знака, который восходит над горизонтом в момент рождения человека. Он оказывает значительное влияние на внешние проявления личности и первое впечатление, которое человек производит на окружающих.\n\nАсцендент в Близнецах наделяет своего носителя блестящим интеллектом и быстрой речью. При низком духовном развитии он может проявлять навязчивость в общении, тогда как при высокой эрудиции становится интересным и увлекательным собеседником. Восходящие Близнецы склонны распылять свою энергию и иногда оказываются поверхностными в знаниях. Внешне они высокие и худые, с узкими глазами и длинным носом, обладая легкой походкой и вьющимися волосами. Женщины с Асцендентом в Близнецах часто ведут несколько романтических отношений одновременно. Они активные путешественницы и открыты к сексуальным экспериментам. Мужчины с таким Асцендентом отличаются любознательностью и энергией, но склонны попадать в плохие компании. Такие мужчины влюбчивы, ветрены и часто меняют поклонниц. В профессиональной сфере восходящие Близнецы стремятся быть первыми и могут прибегать к интригам, чтобы достичь успеха. Они хорошо реализуются в таких областях, как международный бизнес, искусство, журналистика и литература."
        },
        {
          "id": 4,
          "zodiac_sign": "Рак",
          "description": "Асцендент — градус зодиакального знака, который восходит над горизонтом в момент рождения человека. Он оказывает значительное влияние на внешние проявления личности и первое впечатление, которое человек производит на окружающих.\n\nЧеловек с Асцендентом в Раке обаятельный и эмпатичный. Однако при этом он стремится к независимости и не забывает обиды. Семья и дом занимают важное место в  его жизни. Внешне люди с Асцендентом в Раке невысокие, круглолицые, с яркими губами и пухлыми щеками. Их речь может быть неразборчивой. Женщины с Асцендентом в Раке впечатлительны и ранимы, но способны превратить мужчин в подкаблучников. Мужчины с таким Асцендентом стремятся заявить о своих талантах, но часто испытывают стеснение. Их вдохновляет восхищение и одобрение, которое им дарят окружающие. Людям с Асцендентом в Раке нужна гармоничная обстановка, похожая на семейную. Многие с таким Асцендентом меняют места работы или работают на фрилансе, так как не являются достигаторами по натуре и уважают дружбу и дипломатию. Порой их профессии могут быть связаны с театром, медициной, педагогикой, историей и археологией."
        },
        {
          "id": 5,
          "zodiac_sign": "Лев",
          "description": "Асцендент — градус зодиакального знака, который восходит над горизонтом в момент рождения человека. Он оказывает значительное влияние на внешние проявления личности и первое впечатление, которое человек производит на окружающих.\n\nЛюди с Асцендентом во Льве неизменно привлекают к себе внимание, искусно направляя людей для достижения своих целей. Они ведут себя как прирожденные лидеры, способные распознавать таланты и умело их развивать. Внешне таких личностей выделяют огненно-рыжие волосы, высокий лоб и выразительные большие глаза. Восходящий Лев обожает роскошь и всегда стремится к власти и влиянию. Женщины с Асцендентом во Льве излучают радость и оптимизм, благодаря своей жизнерадостности они становятся прекрасными матерями. Мужчины с таким Асцендентом часто становятся лидерами или артистами, уверенно ведя за собой окружающих. Однако, несмотря на свою силу, мужчина с Асцендентом во Льве не стремится подавлять других и не вызывает раздражения — его отличают вежливость и благородство, которые делают его притягательным для женщин. Он становится заботливым отцом и бережно хранит воспоминания о собственном детстве. Профессиональная деятельность людей, которых Асцендент во Льве, часто связана с государственными структурами, военным делом, театром, кино, шоу-бизнесом, цирком, телевидением, где их харизма и амбиции находят блестящее применение."
        },
        {
          "id": 6,
          "zodiac_sign": "Дева",
          "description": "Асцендент — градус зодиакального знака, который восходит над горизонтом в момент рождения человека. Он оказывает значительное влияние на внешние проявления личности и первое впечатление, которое человек производит на окружающих.\n\nАсцендент в Деве указывает на стремление человека к саморазвитию, дисциплине и организованности. Такие люди любят планировать и составлять списки, уделяя большое внимание деталям и критически оценивая окружающую действительность. В общении они обычно сдержанны и немного замкнуты, но наблюдательны и склонны к анализу. Их перфекционизм и высокие стандарты часто выражаются как в работе, так и в личной жизни. Люди с этим Асцендентом ценят независимость и стремятся к материальному благополучию. Внешне они обычно имеют изящные черты лица, миндалевидные глаза и сухую кожу. Женщины с Асцендентом в Деве отличаются трудолюбием, аккуратностью и чистоплотностью, но могут казаться придирчивыми и несколько занудными. Мужчины же демонстрируют высокий уровень организованности. Они становятся заботливыми и ответственными отцами. Трудоголизм и нервные перегрузки также не редкость для личностей с таким Асцендентом. Карьера людей с Асцендентом в Деве часто связана с финансами, наукой, медициной, политикой или преподаванием."
        },
        {
          "id": 7,
          "zodiac_sign": "Весы",
          "description": "Асцендент — градус зодиакального знака, который восходит над горизонтом в момент рождения человека. Он оказывает значительное влияние на внешние проявления личности и первое впечатление, которое человек производит на окружающих.\n\nАсцендент в Весах делает человека обаятельным и приятным в общении. Он стремится к мирному разрешению конфликтов и поддержанию гармонии. Внешне такой человек обычно отличается высоким ростом, классическими чертами лица, стройной фигурой и выразительными глазами. Женщины с Асцендентом в Весах уделяют большое внимание своей внешности, редко выбирая роль домохозяйки, и обладают свободолюбивым характером. Мужчины с таким Асцендентом привлекательны и склонны к тщеславию. Хотя Асцендент в Весах придает людям обаяние, он также делает их нерешительными. Им бывает сложно принимать важные решения. Под влиянием гармоничной Венеры они умны и галантны, но могут испытывать неуверенность в себе, что иногда подталкивает их к провокационным поступкам. Эти люди легко могут вскружить голову окружающим, но иногда забывают даже такие детали, как имена. Профессиональная сфера восходящих Весов связана с киноиндустрией, модельным бизнесом, театром, балетом, музыкой, искусством и юриспруденцией."
        },
        {
          "id": 8,
          "zodiac_sign": "Скорпион",
          "description": "Асцендент — градус зодиакального знака, который восходит над горизонтом в момент рождения человека. Он оказывает значительное влияние на внешние проявления личности и первое впечатление, которое человек производит на окружающих.\n\nАсцендент в Скорпионе побуждает человека глубоко анализировать свой внутренний мир и разгадывать тайны окружающих. Такие люди могут проявлять себя как талантливые психологи или астрологи. Они импульсивны и могут быть очень жестоки в моменты гнева, при этом обладают сильным стремлением побеждать. Внешне такие люди могут казаться мрачными или насмешливыми. Как правило, у них гипнотический взгляд и властные манеры. Женщины с Асцендентом в Скорпионе сексуально привлекательны, наблюдательны и часто находятся в борьбе между желанием достичь славы и склонностью к лени. Мужчины с таким Асцендентом жестки и прямолинейны. Они стремятся к лидерским позициям и тщательно выбирают себе умных и преданных друзей. Их привлекают холодные и уверенные в себе женщины, но в браке они редко проявляют заботу. Личности с Асцендентом в Скорпионе часто добиваются успеха в политике, военной сфере и науке."
        },
        {
          "id": 9,
          "zodiac_sign": "Стрелец",
          "description": "Асцендент — градус зодиакального знака, который восходит над горизонтом в момент рождения человека. Он оказывает значительное влияние на внешние проявления личности и первое впечатление, которое человек производит на окружающих.\n\nЛюди с Асцендентом в Стрельце обычно улыбчивы, общительны, но при этом держатся с достоинством. Они хорошие организаторы и руководители и свободны от строгих догм и предубеждений, даже если относят себя к какой-либо конфессии. Внешне такие люди отличаются крупным телосложением, квадратной формой головы и выпуклым лбом. Они могут быть беззастенчивы и немного эксцентричны. Женщины с Асцендентом в Стрельце требуют внимания и щедрых подарков, они любят путешествия и активную профессиональную жизнь. Мужчины с этим Асцендентом независимы и склонны к доминированию. Личности с Асцендентом в Стрельце легко теряют терпение и стараются брать от жизни всё. Они романтичны и любят похвастаться своими достижениями. Профессиональные направления людей с таким Асцендентом часто связаны с политикой, военным делом, путешествиями и педагогикой."
        },
        {
          "id": 10,
          "zodiac_sign": "Козерог",
          "description": "Асцендент — градус зодиакального знака, который восходит над горизонтом в момент рождения человека. Он оказывает значительное влияние на внешние проявления личности и первое впечатление, которое человек производит на окружающих.\n\nЧеловек с Асцендентом в Козероге отличается сложным характером и сильной целеустремлённостью. Он упрям и строг в отношениях с окружающими. Часто такие люди рождаются в серьёзной или напряжённой обстановке. Для них важно занять высокое положение в обществе, и они активно к этому стремятся. Внешне они обычно выглядят моложе своего возраста. Женщины с Асцендентом в Козероге нацелены на лидерство и делают всё возможное, чтобы избегать ошибок. Мужчины с таким Асцендентом умны, решительны и практичны, но склонны скрывать чувства и выражать любовь через материальные поступки. Всех людей с Асцендентом в Козероге отличает аналитический склад ума, который позволяет достигнуть больших успехов в технических дисциплинах. Профессиональная сфера людей, у котрых Асцендент в Козероге, часто связана с политикой, финансами и сельским хозяйством."
        },
        {
          "id": 11,
          "zodiac_sign": "Водолей",
          "description": "Асцендент — градус зодиакального знака, который восходит над горизонтом в момент рождения человека. Он оказывает значительное влияние на внешние проявления личности и первое впечатление, которое человек производит на окружающих.\n\nЧеловек с Асцендентом в Водолее отличается дружелюбием и оптимизмом. Он проявляет интерес к мистике и современным технологиям, склонен к частым сменам настроения. Такой человек может быть язвительным, но при этом романтичен. Люди с Асцендентом в Водолее нередко меняют партнёров в поиске новых впечатлений и эмоций. Внешне такие люди обычно худощавы и привлекательны. У них гибкие суставы и не менее гибкий ум. Женщины с Асцендентом в Водолее увлекаются путешествиями и творческими занятиями. Их привлекают оптимистичные люди, и они терпеть не могут нытиков. Мужчины с таким Асцендентом веселы, идеалистичны и легко находят общий язык с окружающими. Профессиональные области, в которых личности а Асцендентом в Водолее, часто находят себя в военном деле, политике или искусстве."
        },
        {
          "id": 12,
          "zodiac_sign": "Рыбы",
          "description": "Асцендент — градус зодиакального знака, который восходит над горизонтом в момент рождения человека. Он оказывает значительное влияние на внешние проявления личности и первое впечатление, которое человек производит на окружающих.\n\nЛюди с Асцендентом в Рыбах отличаются романтичностью и высокой чувствительностью. Они часто живут в мире грёз, проявляя бескорыстие и готовность к самопожертвованию. Такие люди болезненно воспринимают критику и могут глубоко переживать негативные замечания. Внешне человек, у которого Асцендент в Рыбах, может не выделяться среди других. Несмотря на жизнерадостность и общительность, люди с Асцендентом в Рыбах периодически нуждаются в уединении. Женщины с Асцендентом в Рыбах доверчивы и ранимы, их тянет к творчеству и искусству. Мужчины с таким Асцендентом склонны к инфантильности и иногда ведут себя непредсказуемо. Профессиональная деятельность восходящих Рыб часто связана с медициной, искусством и торговлей напитками."
        }
      ]
    },
    "Луна": {
      "structure": {
        "columns": [
          "id",
          "zodiac_sign",
          "description"
        ],
        "total_records": 12
      },
      "data": [
        {
          "id": 1,
          "zodiac_sign": "Овен",
          "description": "Луна символизирует внутренний мир человека и его эмоциональное состояние. Она проливает свет на эмоциональные потребности личности и отражает ее внутренние процессы.\n\nЛуна в Овне описывает человека, стремящегося к популярности и признанию. Лунные Овны оптимистичны и жизнерадостны. Они не умеют скрывать свои чувства, поэтому эмоции таких людей всегда очевидны для других. Для них жизнь — это постоянное приключение или соревнование, поэтому такие люди с трудом переносят спокойствие и рутину. Люди с Луной в Овне стремятся привнести перемены и веселье в повседневность. Основные их качества включают жизнелюбие, энергичность, любовь к публичности и переменам, а также потребность в физической активности. Они быстро реагируют на происходящее, но должны быть осторожны с травмами головы и ожогами. Спорт оказывает положительное влияние на их здоровье и эмоциональное состояние. Мужчины с Луной в Овне влюбчивы и темпераментны, стремятся казаться героями в глазах своих избранниц. Женщины с таким положением Луны активны, самостоятельны и импульсивны, они воспитывают детей как сильных и смелых личностей, и любят вносить изменения в обстановку дома. Чтобы найти общий язык с лунным Овном, важно дать им свободу следовать своему пути и подчёркивать их уникальность."
        },
        {
          "id": 2,
          "zodiac_sign": "Телец",
          "description": "Луна символизирует внутренний мир человека и его эмоциональное состояние. Она проливает свет на эмоциональные потребности личности и отражает ее внутренние процессы.\n\nЛюди с Луной в Тельце чрезвычайно практичны. Луна, символ воды, чувствует себя комфортно в земном знаке Тельца, где ее качества проявляются свободно. Люди с Луной в Тельце стремятся к стабильности, комфорту и уюту. Они трудолюбивы, ценят результаты своего труда. Им важно иметь жилье, семью и материальное благополучие. Восстановление сил происходит на природе, где взаимодействие с землей дает им  энергию и уверенность. Основные черты людей с Луной в Тельце: мягкость, миролюбие, стремление к творчеству и трудолюбие. Люди с таким положением привязаны к дому и семье. Организм таких людей склонен к накоплению питательных веществ, что может приводить к избыточному весу. Рекомендации по здоровью включают в себя контроль веса, защиту горла и шеи, а также физическую активность. Мужчины с Луной в Тельце постоянны в своих чувствах и стремятся к стабильному браку. Они ценят доброту, красоту и умение создавать уют в доме. Женщины с Луной в Тельце заботливы, талантливы и создают гармонию в доме. Они могут реализовывать свои творческие способности в разных сферах. Для взаимодействия с ними важно не торопить их, а также поддерживать их увлечения."
        },
        {
          "id": 3,
          "zodiac_sign": "Близнецы",
          "description": "Луна символизирует внутренний мир человека и его эмоциональное состояние. Она проливает свет на эмоциональные потребности личности и отражает ее внутренние процессы.\n\nЛюди с Луной в Близнецах общительны, любознательны и эрудированы. Они легко усваивают информацию, любят путешествовать и познавать новое. Однако их настроение может часто меняться, что делает их несколько суетливыми и склонными к мечтаниям. Чтобы сохранять баланс, таким людям рекомендуется регулярно делать перерывы и переключаться между различными видами деятельности. Мужчины с Луной в Близнецах легко заводят знакомства, но могут быть склонны к нестабильности в отношениях. Женщины с такой Луной стремятся к разнообразию и активному общению внутри семьи. Чтобы наладить гармоничные отношения с лунным Близнецом, важно быть интересным собеседником, поддерживать его инициативы и предоставлять интеллектуальную поддержку."
        },
        {
          "id": 4,
          "zodiac_sign": "Рак",
          "description": "Луна символизирует внутренний мир человека и его эмоциональное состояние. Она проливает свет на эмоциональные потребности личности и отражает ее внутренние процессы.\n\nЛюди с положением Луны в Раке самодостаточны, эмоционально сильны и умеют создавать уютную, тёплую атмосферу в доме и семье. Они не стремятся к внешним достижениям или социальному продвижению, предпочитают сосредоточиться на своём внутреннем мире и семейных ценностях. Лунные Раки заботливы, доброжелательны и обладают развитой интуицией. Они глубоко привязаны к дому и семье, любят детей и умеют о них заботиться. Эти люди отличаются терпением и бережливостью. Мужчины с Луной в Раке часто видят в супруге заботливую мать и хозяйку, ценят уют и порядок в доме. Женщины с таким положением Луны особенно чувствительны, романтичны и считают семью высшей ценностью в жизни. Чтобы найти общий язык с Лунным Раком, важно проявлять внимание к его чувствам, уважать традиции и создавать комфортную и уютную обстановку в доме."
        },
        {
          "id": 5,
          "zodiac_sign": "Лев",
          "description": "Луна символизирует внутренний мир человека и его эмоциональное состояние. Она проливает свет на эмоциональные потребности личности и отражает ее внутренние процессы.\n\nЛуна во Льве в гороскопе указывает на ярких и заметных людей, обладающих авторитетом. Люди с таким положением активно участвуют в общественной жизни и умеют себя подать. Обладатели Луны во Льве уверены в себе, стремятся к популярности и социальному успеху. Они артистичны, оптимистичны и жизнерадостны, любят творчество и самовыражение. Им важно следить за здоровьем, особенно за сердечно-сосудистой системой и зрением. Мужчины с Луной во Льве серьезно относятся к выбору спутницы жизни, ценят благородство. Женщины с таким положением Луны стремятся к высокому уровню жизни, гордятся своими детьми и любят устраиваивать праздники. Чтобы найти общий язык с Лунным Львом, нужно восхищаться им и окружать роскошью."
        },
        {
          "id": 6,
          "zodiac_sign": "Дева",
          "description": "Луна символизирует внутренний мир человека и его эмоциональное состояние. Она проливает свет на эмоциональные потребности личности и отражает ее внутренние процессы.\n\nЛуна в Деве характеризуется практичностью, трудолюбием и умением решать бытовые вопросы. Люди с таким положением Луны обращают внимание на детали, разбираются в технологиях и отличаются критическим мышлением. Они ценят порядок и предпочитают здоровое питание. Иногда их критичность и дотошность могут мешать отношениям с окружающими. Мужчины с Луной в Деве серьезно относятся к выбору спутницы жизни, ценят умных женщин. Женщины с Луной в Деве заботятся о домашнем хозяйстве и здоровье семьи, уделяют внимание воспитанию детей. Чтобы найти общий язык с Лунной Девой, нужно проявлять внимание к ее интересам."
        },
        {
          "id": 7,
          "zodiac_sign": "Весы",
          "description": "Луна символизирует внутренний мир человека и его эмоциональное состояние. Она проливает свет на эмоциональные потребности личности и отражает ее внутренние процессы.\n\nЛюди с Луной в Весах миролюбивы, общительны и стремятся к гармонии. Они легко находят общий язык с другими, умеют сглаживать конфликты и искать компромиссы. Лунные Весы заботятся о своем здоровье и внешности, занимаются спортом и поддерживают свою привлекательность. Мужчины с Луной в Весах очень влюбчивы, выбирают веселых и легких на подъем женщин. Женщины с Луной в Весах ценят красоту и искусство, заботятся о развитии творческих способностей своих детей. Чтобы найти общий язык с Лунными Весами, нужно создавать вокруг них атмосферу гармонии и избегать конфликтов."
        },
        {
          "id": 8,
          "zodiac_sign": "Скорпион",
          "description": "Луна символизирует внутренний мир человека и его эмоциональное состояние. Она проливает свет на эмоциональные потребности личности и отражает ее внутренние процессы.\n\nЛуна в Скорпионе отражает сложный и противоречивый характер. Лунные Скорпионы эмоциональны, чувствительны и интуитивны, но также могут быть недоверчивыми и ревнивыми. Они проявляют решительность в сложных ситуациях и борются со злом. Лунные Скорпионы нуждаются в эмоциональной разрядке через спорт и экстремальные занятия. Мужчины с Луной в Скорпионе ревнивы и страстны, но после периода нестабильности их отношения стабилизируются. Женщины с Луной в Скорпионе активны, боевые и контролируют своих детей. Чтобы найти подход к Лунному Скорпиону, нужно создать ощущение надежности и безопасности, верить в его силы и принять его характер."
        },
        {
          "id": 9,
          "zodiac_sign": "Стрелец",
          "description": "Луна символизирует внутренний мир человека и его эмоциональное состояние. Она проливает свет на эмоциональные потребности личности и отражает ее внутренние процессы.\n\nЛуна в Стрельце характеризуется энергичностью, активностью и жизнелюбием. Лунные Стрельцы гибкие, целеустремленные и открытые к новым знаниям. Они энтузиасты, оптимисты и лояльны к чужому мнению. Мужчины с Луной в Стрельце свободны и независимы в отношениях, они ищут умных и образованных женщин. Женщины с Луной в Стрельце независимы, образованы и вдохновляют других на развитие. Лунные Стрельцы любят путешествия и спортивные соревнования, а также не любят болеть."
        },
        {
          "id": 10,
          "zodiac_sign": "Козерог",
          "description": "Луна символизирует внутренний мир человека и его эмоциональное состояние. Она проливает свет на эмоциональные потребности личности и отражает ее внутренние процессы.\n\nЛуна в Козероге холодна и аскетична. Люди с такой Луной скрывают свои эмоции и переживания, не любят перемены и медленно адаптируются к изменениям. Они серьезные, дисциплинированные и осторожные. Лунные Козероги сдержанны, тактичны и вежливы, но также могут быть нерешительными и склонными к зависимости. Мужчины с Луной в Козероге сталкиваются с трудностями в отношениях из-за своей дистанционности. Женщины с Луной в Козероге практичны, целеустремленны и ориентированы на карьеру. Чтобы найти подход к Лунному Козерогу, нужно поддерживать в отношениях с ним стабильность и уверенность."
        },
        {
          "id": 11,
          "zodiac_sign": "Водолей",
          "description": "Луна символизирует внутренний мир человека и его эмоциональное состояние. Она проливает свет на эмоциональные потребности личности и отражает ее внутренние процессы.\n\nЛуна в Водолее характеризуется открытостью, контактностью и общительностью. Люди с таким положением дружелюбны и всегда готовы помочь другим. Они обладают нестандартным мышлением. Мужчины с Луной в Водолее ищут партнерш, которые будут им единомышленницами. Женщины с Луной в Водолее развиты, независимы и оригинальны. Они верят в позитивное будущее и поддерживают своих детей в развитии. Лунные Водолеи могут испытывать нервное напряжение из-за общения с большим количеством людей."
        },
        {
          "id": 12,
          "zodiac_sign": "Рыбы",
          "description": "Луна символизирует внутренний мир человека и его эмоциональное состояние. Она проливает свет на эмоциональные потребности личности и отражает ее внутренние процессы.\n\nЛуна в Рыбах чувствует себя комфортно в водной стихии, проявляя мечтательность, обаяние и богатый внутренний мир. Лунные Рыбы чувствительны, сострадательны и обладают развитой интуицией. Они любят творить и заботиться о других. Мужчины с Луной в Рыбах нерешительны в отношениях, но могут обрести счастье с доброй и любящей женщиной. Женщины с Луной в Рыбах заботливы и исполнительны, работают в сферах педагогики, психологии и здравоохранения. Лунные Рыбы нуждаются в уединении и поддержке."
        }
      ]
    },
    "Меркурий": {
      "structure": {
        "columns": [
          "id",
          "zodiac_sign",
          "description"
        ],
        "total_records": 12
      },
      "data": [
        {
          "id": 1,
          "zodiac_sign": "Овен",
          "description": "Меркурий — это планета общения, интеллекта и рационального мышления. Она управляет психическими процессами и тем, как люди принимают решения.\n\nДля Меркурия в Овне характерен мощный интеллект, который позволяет человеку быть остроумным, находчивым и легко усваивать информацию. Он делает человека ярким собеседником, способным мгновенно находить аргументы и парировать выпады оппонентов. Однако, эта огненная энергия может быть и слишком импульсивной, что приводит к тому, что человек говорит, а потом думает, часто попадая в неприятные ситуации. Обладатели Меркурия в Овне – это харизматичные личности с неутолимой жаждой знаний, но склонные к спорам и иногда грубости. Мужчины с Меркурием в Овне — яркие лидеры, а женщины — независимые и интеллектуальные, но могут быть резкими и прямолинейными. Ретроградный Меркурий в Овне делает человека более вдумчивым и внимательным, но может вызвать сложности в общении с Овнами, Львами и Стрельцами. Ключевой момент для всех обладателей Меркурия в Овне — научиться управлять своим взрывным интеллектом, направляя его во благо, а не во вред."
        },
        {
          "id": 2,
          "zodiac_sign": "Телец",
          "description": "Меркурий — это планета общения, интеллекта и рационального мышления. Она управляет психическими процессами и тем, как люди принимают решения.\n\nДля Меркурия в Тельце характерен ум, который работает медленно, но тщательно обрабатывает информацию. Такие люди склонны к вдумчивости, упрямству и практичности. Они не торопятся высказывать свое мнение, но раз уж сформировали его, то будут отстаивать его до конца. Медленное, но тщательное мышление, упрямство и нежелание менять свое мнение, практичность, интерес к материальным благам, любовь к красоте, искусству и вкусной еде, доброжелательность и терпеливость, склонность к консерватизму — все это отличительные черты обладателей Меркурия в Тельце. Женщины с таким положением планеты — спокойные, очаровательные собеседницы, но способные выступить ярой спорщицей в защите своих убеждений. Мужчины — верные партнеры, ценящие комфорт и склонные к ручному творчеству. Ретроградный Меркурий в Тельце затрудняет практическое применение знаний и делает человека склонным к откладыванию дел и нежеланию менять привычный образ жизни. Меркурию в Тельце требуется время, чтобы сформировать свое мнение, но также такие люди проявляют глубокое понимание и стойкость в своих убеждениях."
        },
        {
          "id": 3,
          "zodiac_sign": "Близнецы",
          "description": "Меркурий — это планета общения, интеллекта и рационального мышления. Она управляет психическими процессами и тем, как люди принимают решения.\n\nВ астрологии Меркурий связан с знаком Близнецов и отвечает за способность человека быстро мыслить, общаться, находить информацию и строить отношения. Находясь в своем доме (Близнецы), Меркурий усиливает эти качества и способствует финансовому успеху через применение знаний. Однако Меркурий в Близнецах может быть переменчив в верности и преданности. Обладатели такой позиции склонны к частым сменам мнений, раздражительности, болтливости и язвительности. Они обладают высокой адаптивностью и умеют находить выход из сложных ситуаций, но могут страдать от нервных срывов при длительном напряжении. Гармонично расположенный Меркурий в Близнецах делает своего обладателя обаятельным, красноречивым и успешным. Такой человек способен увлекательно говорить на любые темы, обладает острым умом и чувством юмора. Ретроградный Меркурий в Близнецах создает трудности с выражением своих мыслей и завершением начатых дел. Необходимо работать над усилением самодисциплины и концентрации. Неблагоприятные аспекты с Лилит, Ураном и Плутоном могут привести к развитию негативных черт характера, таких как манипуляции, эксцентричность и стремление к социальным переменам любой ценой."
        },
        {
          "id": 4,
          "zodiac_sign": "Рак",
          "description": "Меркурий — это планета общения, интеллекта и рационального мышления. Она управляет психическими процессами и тем, как люди принимают решения.\n\nМеркурий в Раке — это ум, глубоко связанный с эмоциями, склонный к вдумчивости, чувствительности и фантазированию. Такие люди могут быть раздражительными и мнительными, их интеллект и успех зависят от их эмоционального состояния. Они обладают богатой фантазией, нестандартным подходом к решению проблем, сильной интуицией и высокой чувствительностью, но склонны к раздражительности, недоверию, неуверенности в себе, страху перед новым, трудностям с выражением чувств и предпочитают уединение. Мужчины с Меркурием в Раке часто раздражительны и негативно настроены, а женщины — чувствительные и мечтательные, предпочитающие свой мир и склонные к иллюзиям. Ретроградный Меркурий в Раке усиливает мнительность и недоверие, что может мешать построению отношений и успешной карьере. Обладатели Меркурия в Раке — это личности, нуждающиеся в понимании и терпении. Чтобы раскрыть свой потенциал и достичь успеха, им важно научиться управлять эмоциями и развивать самоуверенность."
        },
        {
          "id": 5,
          "zodiac_sign": "Лев",
          "description": "Меркурий — это планета общения, интеллекта и рационального мышления. Она управляет психическими процессами и тем, как люди принимают решения.\n\nМеркурий во Льве — это мощное сочетание, которое наделяет человека яркой харизмой, блестящим умом и творческими способностями. Такие люди обладают недюжинным интеллектом, широким кругозором и умением увлечь аудиторию своим красноречием. Они стремятся к лидерству, любят быть в центре внимания и делают все возможное, чтобы добиться успеха и признания. Могут быть эгоцентричным и склоны полагать, что мир вращается вокруг них. Мужчина с Меркурием во Льве часто считает себя центром вселенной, а женщина прозорлива и умеет извлекать выгоду из любой ситуации. Ретроградный Меркурий во Льве усиливает уверенность в себе, но может привести к неспособности к самокритике. В целом, Меркурий во Льве — это яркое и харизматичное сочетание, которое может привести к успеху и признанию, но также и к эгоцентризму и самоуверенности."
        },
        {
          "id": 6,
          "zodiac_sign": "Дева",
          "description": "Меркурий — это планета общения, интеллекта и рационального мышления. Она управляет психическими процессами и тем, как люди принимают решения.\n\nМеркурий в Деве дарит человеку острый ум, энциклопедические знания и красноречие. Он жаждет мудрости, постоянно развивая интеллект и анализируя мир. Его мозг работает как компьютер, позволяя ему отсекать лишнее и видеть суть вещей. В негативном проявлении, он может стать занудой, стремящимся подчеркнуть свое превосходство. Для успешной работы ему нужно уединение, он — идеальный фрилансер. Он ответственен, честен и стремится к безупречной репутации, что делает его отличным работником. Основные черты: усидчивость, терпение, наблюдательность, любовь к кропотливому труду, талант к языкам, математике, логике, медицине, литературе, критичность, мнительность, верность, гибкость мышления, отличная память, коммерческая жилка. \nМужчина с таким положением часто придирчив и требователен в общении, но сам стремится соответствовать высоким стандартам. С возрастом становится домоседом, любит интернет и библиотеку. Женщины с Меркурием в Деве обладают схожими чертами, но еще более терпеливы и наблюдательны. Они критичны к окружающим и скептически относятся к влюбленности, считая, что никто не может полюбить их безусловно. Ретроградный Меркурий в Деве может привести к тому, что человек предпочитает письменное выражение мыслей устному. Он склонен анализировать все логически, контролировать свои действия, и малейшие изменения в планах вызывают у него нервное напряжение. Важно заниматься йогой, ходить на массаж, заниматься в театральной студии."
        },
        {
          "id": 7,
          "zodiac_sign": "Весы",
          "description": "Меркурий — это планета общения, интеллекта и рационального мышления. Она управляет психическими процессами и тем, как люди принимают решения.\n\nМеркурий в Весах дарит человеку интуицию, любовь к прекрасному и красноречие. Он прирожденный адвокат, защищающий высокие идеалы. Однако, влияние Венеры и Хирона делает его противоречивым, способным на душевность и высокомерие, искренность и холодность. Такой человек вечно молод душой, жаждет новых знаний и свершений. Внешне спокоен и миролюбив, но за этим скрывается несгибаемая воля и властность. Он дипломатичен, умеет находить слова для усмирения противников. Он не выносит грубости, в сфере управления, искусства или моды раскрывает свой талант руководителя и творца. Мужчина с гармоничным Меркурием в Весах мягок в форме выражения жестких решений, но непреклонен. Женщина с Меркурием в Весах полна оригинальных идей, но часто стесняется продвигаться по карьерной лестнице. Обладатели ретроградного Меркурия в Весах тщательно подбирают слова, что приводит к задержке реакции и мнительности. Им нужно развивать уверенность в себе и умение закрывать темы, не рефлексируя насчет реакции собеседника."
        },
        {
          "id": 8,
          "zodiac_sign": "Скорпион",
          "description": "Меркурий — это планета общения, интеллекта и рационального мышления. Она управляет психическими процессами и тем, как люди принимают решения.\n\nМеркурий в Скорпионе, под влиянием Плутона и Марса, наделяет человека острым умом и язвительной речью. Он критичен, но в разговорах о смерти и сексе раскрывается как умный и наблюдательный собеседник. Обладатель этого положения обладает шестым чувством, легко усваивает информацию и интересуется тайными знаниями. Он склонен к глубокому анализу, обладает даром гипноза, откровенен и любит сарказм. Мужчина с Меркурием в Скорпионе более организован, когда находится в стрессовых ситуациях, а в обычной жизни — рассеян и немногословен. Женщина — воинственная, остроумная и находчивая. Обладатели ретроградного Меркурия в Скорпионе более скрытны и мнительны. Они остро реагируют на агрессию и насмешки. Необходимо больше доверять миру, раскрываться в общении."
        },
        {
          "id": 9,
          "zodiac_sign": "Стрелец",
          "description": "Меркурий — это планета общения, интеллекта и рационального мышления. Она управляет психическими процессами и тем, как люди принимают решения.\n\nМеркурий в Стрельце, под влиянием Юпитера, дарит человеку глубокое мышление и склонность к поучениям. Он рубит правду-матку, не задумываясь о последствиях. Обладатель этого положения оптимистичен, любит анекдоты и иностранные языки. Он склонен к невнимательности и самонадеянности, но Юпитер помогает ему избежать серьезных проблем. Он часто имеет раздвоение личности: с одной стороны, он талантлив в языках и философии, с другой — склонен к косноязычию, грубоватости и навязыванию своего мировоззрения. Мужчина с Меркурием в Стрельце ведет себя галантно или нагло, любит демонстрировать свой интеллект. Женщина — амбициозна и любознательна, уверена в своей правоте. Ретроградный Меркурий в Стрельце делает человека молчаливым и тщательным в выборе слов для публичного выступления."
        },
        {
          "id": 10,
          "zodiac_sign": "Козерог",
          "description": "Меркурий — это планета общения, интеллекта и рационального мышления. Она управляет психическими процессами и тем, как люди принимают решения.\n\nМеркурий в Козероге, под влиянием Сатурна, наделяет человека расчетливостью, эмоциональной сдержанностью и умением достигать целей. Он амбициозен, стремится к высокому положению и богатству. Обладатель этого положения ценит честность и трудолюбие, но способен на коварство, если на кону его цели. Он склонен к злопамятности и высокомерию, что может привести к потере друзей или положения. Ему важно развивать сердечную чакру, чтобы уравновесить холодный разум. Он обладает талантом дипломата, математика, стратега, руководителя. Мужчина с Меркурием в Козероге чуткий собеседник, но его ум может застыть в стереотипах. Ему нужно постоянно развиваться и расширять кругозор. Женщина — лидер, амбициозна и желает доказать, что женский ум не уступает мужскому. Она может быть жесткой и грубоватой в выражениях. Обладатель ретроградного Меркурия в Козероге борется с самолично созданными догмами, которые ограничивают его жизнь. Ему нужно развивать гибкость мышления и общаться с успешными людьми."
        },
        {
          "id": 11,
          "zodiac_sign": "Водолей",
          "description": "Меркурий — это планета общения, интеллекта и рационального мышления. Она управляет психическими процессами и тем, как люди принимают решения.\n\nМеркурий в Водолее, под влиянием Урана, дарит человеку дальновидность, свободу мысли и творческий потенциал. Он создает новые проекты, вовлекая мир в свою мечту. Обладатель этого положения склонен к технологическим новаторствам и переездам за границу. Его голос звучит особенно хорошо в телефонных разговорах, радио и телепередачах. Он обладает оригинальным умом, генерирует революционные идеи и знает, как их воплотить. Его интуиция может опережать время, и его идеи могут восприниматься как фантазии. Он легко заводит знакомства, обладает невероятной интуицией и спонтанным юмором. Ему важна командная работа, дружба и свобода. Мужчина с Меркурием в Водолее отрицает традиционные ценности, ищет партнершу-соратницу по духовным стремлениям. Женщина — оптимистка, общительна и находчива. Ее успех связан с ее связями, а не с глубокими знаниями. Ретроградный Меркурий в Водолее делает человека либо скрытным, либо демонстративно странным. Его открытия могут быть похищены более прагматичными людьми."
        },
        {
          "id": 12,
          "zodiac_sign": "Рыбы",
          "description": "Меркурий — это планета общения, интеллекта и рационального мышления. Она управляет психическими процессами и тем, как люди принимают решения.\n\nМеркурий в Рыбах, под влиянием Нептуна, наделяет человека глубокой интуицией и творческим потенциалом. Он способен создавать гениальные произведения искусства, но ему нужно преодолеть лень и чувствительность к критике. Обладатель этого положения склонен к мечтательности и погружению в творчество. Его речь образная и сложная для понимания, поэтому он предпочитает выражать мысли на бумаге. Его разум тесно связан с эмоциями. Депрессия мешает ему, а хорошее настроение делает его блестящим. Он обладает эмпатией, экстрасенсорными способностями и чувствительностью к тайнам. Мужчина с Меркурием в Рыбах склонен к эзотерическим знаниям и становится талантливым психологом, священником или исследователем. Женщина — добрая и отзывчивая, но ей трудно заниматься рутинной работой. Она нуждается в творчестве и признании. Ретроградный Меркурий в Рыбах делает человека вялым, нерешительным и мнительным. Он легко поддается чужому влиянию и может стать жертвой мошенников."
        }
      ]
    },
    "Венера": {
      "structure": {
        "columns": [
          "id",
          "zodiac_sign",
          "description"
        ],
        "total_records": 12
      },
      "data": [
        {
          "id": 1,
          "zodiac_sign": "Овен",
          "description": "Венера — планета, которая отвечает за красоту, гармонию, чувственность, способность любить, наслаждение, выбор. Она регулирует отношения людей и эстетические ценности.\n\nВенера в Овне, под влиянием Марса, проявляет себя ярко и демонстративно, стремясь к страстям и власти. Она нетерпелива, поспешна и грубовата, что может приносить проблемы. Ей нужно направлять свою жажду внимания и страсти в продуктивное русло.Обладатель Венеры в Овне — лидер, который привлекает внимание своей яркостью и дерзостью. Он склонен к агрессивности и не боится ранить чувства других. Ему важно побеждать, даже если для этого придется обманывать или унижать. Он нетерпелив, обидчив, склонен к хвастовству и эгоизму. Женщина с Венерой в Овне — амазонка, которая доказывает свое превосходство над мужчинами. Она амбициозна, инициативна в отношениях и не боится быть открытой. Мужчина с Венерой в Овне не романтичен, ему важно быть главным в паре. Он склонен к конкуренции и может быть грубым и оскорбительным. Соединение Венеры с Марсом усиливает сексуальность, непостоянство и вспыльчивость. Это творческие личности, но их жизнь может быть бурной и непредсказуемой."
        },
        {
          "id": 2,
          "zodiac_sign": "Телец",
          "description": "Венера — планета, которая отвечает за красоту, гармонию, чувственность, способность любить, наслаждение, выбор. Она регулирует отношения людей и эстетические ценности.\n\nВенера в Тельце, находясь в своем знаке, наделяет человека любовью к красоте, гармонии и стабильности. Он стремится к серьезным отношениям, ценит материальный достаток и любит чувственные удовольствия.Обладатель Венеры в Тельце — приятный в общении, щедрый и верный. Он ценит душевный покой и стабильность. Он любит дорогие подарки, радует близких приятными мелочами и душевным теплом. Он предпочитает комфорт и роскошь, любит вкусно поесть, выпить хорошее вино и красиво одеваться. Мужчина с Венерой в Тельце предпочитает, чтобы его любимая женщина была красивой, ухоженной и умела готовить. Женщина с Венерой в Тельце привлекательна, женственна и любит ухаживать за собой. Она ценит стабильность в отношениях и мечтает о крепком союзе с достойным мужчиной. Аспекты Венеры с Сатурном и Меркурием могут влиять на отношения с людьми разного возраста, ограничивая его творческий потенциал и личную жизнь."
        },
        {
          "id": 3,
          "zodiac_sign": "Близнецы",
          "description": "Венера — планета, которая отвечает за красоту, гармонию, чувственность, способность любить, наслаждение, выбор. Она регулирует отношения людей и эстетические ценности.\n\nВенера в Близнецах характеризует женщину как ветреную и влюбчивую особу, которая обладает невероятным обаянием и успехом в роли блогера, смм-менеджера и журналиста благодаря своему литературному слогу и интересам ко всему новому. Такие женщины стремятся к общественному вниманию и социальной активности, где могут флиртовать и демонстрировать свои ораторские навыки. Они обладают творческими способностями, часто занимаются писательством, актерством или рисованием. Их привлекают путешествия и свободная жизнь, они ценят дружбу и общение с людьми. Дети с такой Венерой в гороскопе капризны и своенравны, поэтому для их гармоничного развития нужен сильный и понимающий отец. Женщина с воздушной Венерой ценит внимание и ухаживания, при этом редко допускает физическую измену. Мужчины с таким положением Венеры обычно легко завоевывают внимание женщин своим остроумием и живой беседой, но остаются холодными и расчетливыми. Венера в хорошем аспекте с Меркурием усиливает ораторские способности и способствует успехам в политике, поэзии, педагогике и бизнесе."
        },
        {
          "id": 4,
          "zodiac_sign": "Рак",
          "description": "Венера — планета, которая отвечает за красоту, гармонию, чувственность, способность любить, наслаждение, выбор. Она регулирует отношения людей и эстетические ценности.\n\nПланета Венера в индивидуальном гороскопе указывает на сексапильность, глубинные ценности и творческие способности. У мужчин она символизирует идеальный образ возлюбленной, а у женщин — чувственность в отношениях. Вторая линия прочтения касается эмоций и поведения матери, подруг и дочерей натива. Венера в Раке вызывает сложные чувства и перепады настроения. Обладатели Венеры в Раке стремятся найти идеального возлюбленного и друга, который бы понимал их противоречивую натуру. Они очень чувствительны к критике и склонны обижаться. Дом и семья для них очень важны, но их эмоциональная впечатлительность может привести к разрушению счастья. Партнеры должны учитывать их водные черты характера, такие как стремление к слиянию с партнером, заботливость и потребность в доверительных разговорах. Они также могут страдать от своих грехов и неверности. Для снятия напряжения им полезен отдых у пресноводных озер. Женщины с Венерой в Раке часто несчастны в любви и имеют тенденцию привлекать проблемных партнеров. Мужчины ищут в женщинах материнскую заботу и внимание."
        },
        {
          "id": 5,
          "zodiac_sign": "Лев",
          "description": "Венера — планета, которая отвечает за красоту, гармонию, чувственность, способность любить, наслаждение, выбор. Она регулирует отношения людей и эстетические ценности.\n\nПланета Венера в гороскопе связана с творчеством, любовью и роскошью. В женском гороскопе она показывает, как женщина проявляет себя в отношениях, а в мужском — какой образ возлюбленной мужчина считает идеальным. Венера во Льве ассоциируется с гордостью, уверенностью в себе и стремлением к высоким целям. Люди с такой Венерой уверены в своем величии и обладают благородной душой, тонким вкусом и талантами. Они стремятся к общественному статусу и помогают слабым. Любовь к роскоши и брендам — их слабость. Эти люди выделяются своей харизмой и манерами. Они легко добиваются успеха благодаря своим талантам, лидерству и умению привлекать внимание. Они открыты в своих эмоциях и ценят справедливость. Дети с Венерой во Льве болезненно относятся ко второму плану и стремятся доминировать. Женщины с Венерой во Льве красивы и сексуальны, а мужчины мечтают о девушках-кинозвездах. Аспекты Венеры с Солнцем делают людей благородными, великодушными и талантливыми."
        },
        {
          "id": 6,
          "zodiac_sign": "Дева",
          "description": "Венера — планета, которая отвечает за красоту, гармонию, чувственность, способность любить, наслаждение, выбор. Она регулирует отношения людей и эстетические ценности.\n\nВенера в Деве ослабляет свои энергии и требует развития и усиления. В мужском гороскопе она показывает идеальный образ любовницы и творческий потенциал, а в женском — поведение в отношениях и манеру одеваться. Обладатели Венеры в Деве внешне холодны и сдержанны, придерживаются традиций и вежливы. Они верны избранникам, но склонны к разочарованиям из-за высоких стандартов. Они уделяют большое внимание чистоте и бережливости. В отношениях могут быть скованы и застенчивы, не считаются с чужими чувствами и имеют высокие нравственные принципы. Но они внимательны к деталям и успешны в профессиях, связанных с детальной работой. Женщины с Венерой в Деве заботятся о чистоте и предпочитают неброскую одежду. Мужчины могут быть альфонсами и неспособны сильно влюбиться. Управителями Девы являются Меркурий и Прозерпина. Аспекты Венеры с Меркурием важны для профессионализма, а с Прозерпиной помогают превратить недостатки в преимущества."
        },
        {
          "id": 7,
          "zodiac_sign": "Весы",
          "description": "Венера — планета, которая отвечает за красоту, гармонию, чувственность, способность любить, наслаждение, выбор. Она регулирует отношения людей и эстетические ценности.\n\nВенера в Весах оказывает различное влияние на мужчин и женщин, а также зависит от положения Хирона. В женском гороскопе она отражает поведение в любви и общении с близкими, а в мужском — тайные эротические фантазии и потенциал творчества. Венера в Весах находится на пике силы и добавляет изобретательности и оригинальности в отношениях и творчестве. Люди с Венерой в Весах ценят красоту и окружены дорогими вещами. Они дипломатичны и умеют находить компромиссы. Венера в Весах часто проявляется в искусстве. Люди с этим положением Венеры обладают хорошей интуицией и чувством гармонии. Они эмоционально холодны, но сексуальны. Они избегают жестокости и грубости реальности, предпочитая иллюзии. Для гармоничного развития детям с Венерой в Весах нужны занятия искусством и общение с культурными людьми. Женщины с Венерой в Весах красивы и элегантны, выбирают партнеров из высокого социального круга. Мужчины с Венерой в Весах ищут идеальную женщину. Аспекты Венеры влияют на таланты и личную жизнь."
        },
        {
          "id": 8,
          "zodiac_sign": "Скорпион",
          "description": "Венера — планета, которая отвечает за красоту, гармонию, чувственность, способность любить, наслаждение, выбор. Она регулирует отношения людей и эстетические ценности.\n\nВенера в Скорпионе отражает личные отношения и поведение в любви. В мужском гороскопе она показывает идеальный образ возлюбленной. Венера в Скорпионе усиливает страсть и создает эмоциональные взрывы. Люди с Венерой в Скорпионе любят экстремальные ситуации и страдают от ревности и собственничества. Они привлекают финансовые потоки и имеют сильную сексуальную энергию. Но им свойственны гнев, мстительность и нетерпимость. Дети с Венерой в Скорпионе обидчивы и ранимы. Женщины с Венерой в Скорпионе сексуальны и предпочитают носить облегающую одежду темных цветов. Мужчины с Венерой в Скорпионе используют власть и страх для доминирования в отношениях. Соединение Венеры с Плутоном делает их магнетически привлекательными, но зависимыми от любовных мук."
        },
        {
          "id": 9,
          "zodiac_sign": "Стрелец",
          "description": "Венера — планета, которая отвечает за красоту, гармонию, чувственность, способность любить, наслаждение, выбор. Она регулирует отношения людей и эстетические ценности.\n\nВенера в Стрельце отражает удачу в любви и творческий потенциал у мужчин, а у женщин - женское начало и характер отношений с близкими. Венера в Стрельце дает оптимизм и легкость в преодолении трудностей. Люди с Венерой в Стрельце часто влюбляются в иностранцев и успешных людей. Они идеалисты, честные, щедрые и сострадательные. Общение с ними характеризуется искренностью и открытым мышлением. Они любят путешествовать и интересуются знаменитостями. Дети с Венерой в Стрельце контактны и защищают слабых. Женщины с Венерой в Стрельце оптимистки и идеализируют мужчин. Мужчины с Венерой в Стрельце могут быть бабниками, но ищут глубокую любовь. Аспекты с Юпитером помогают самоутверждению и обретению верных друзей."
        },
        {
          "id": 10,
          "zodiac_sign": "Козерог",
          "description": "Венера — планета, которая отвечает за красоту, гармонию, чувственность, способность любить, наслаждение, выбор. Она регулирует отношения людей и эстетические ценности.\n\nВенера в Козероге отражает чувственность, творчество и умение наслаждаться жизнью. В мужском гороскопе она показывает идеальный образ возлюбленной. Венера в Козероге находится под влиянием Сатурна, что ограничивает эмоциональное восприятие и свободу самовыражения. Люди с Венерой в Козероге холодны и осторожны в общении. Они консервативны и амбициозны. Им трудно привлечь внимание противоположного пола. Дети с Венерой в Козероге нуждаются в тепле и личном пространстве. Женщины с Венерой в Козероге выглядят старше сверстниц и молоды до старости. Мужчины с Венерой в Козероге — холостяки, опасающиеся страстных эмоций. Аспекты Венеры с Сатурном усиливают страх отказа и ограничения свободы."
        },
        {
          "id": 11,
          "zodiac_sign": "Водолей",
          "description": "Венера — планета, которая отвечает за красоту, гармонию, чувственность, способность любить, наслаждение, выбор. Она регулирует отношения людей и эстетические ценности.\n\nВенера в Водолее отражает счастье в любви, творчестве и наслаждении жизнью. Люди с Венерой в Водолее влюбляются в необычных и гениальных людей. Они свободолюбивы и креативны. Венера в Водолее наделяет вдохновением и связью с информационным полем Вселенной. Люди с Венерой в Водолее эмоционально холодны и идеалистичны. Они ищут необычные отношения и практикуют свободные отношения. Дети с Венерой в Водолее легко заводят друзей и хорошо учатся. Женщины с Венерой в Водолее идеализируют партнера и ждут особого отношения. Мужчины с Венерой в Водолее равноправны и уважают личное пространство. Уран управляет Водолеем."
        },
        {
          "id": 12,
          "zodiac_sign": "Рыбы",
          "description": "Венера — планета, которая отвечает за красоту, гармонию, чувственность, способность любить, наслаждение, выбор. Она регулирует отношения людей и эстетические ценности.\n\nВенера в Рыбах отражает уровень чувственности, страсти и творческого вдохновения у женщин, а у мужчин — идеальный образ возлюбленной. Венера в Рыбах дает интуицию и жажду любви. Любовь — это смысл жизни и вершина духовных исканий. Люди с Венерой в Рыбах романтичны и идеалистичны. Они спасают несчастных и деструктивных людей. Им трудно влюбиться, не испытав жалости. Дети с Венерой в Рыбах доверчивы и чувствительны. Их нужно беречь от чужого влияния. Мужчины с Венерой в Рыбах преданны и поддерживают избранницу. Женщины с Венерой в Рыбах мечтательны и эмоционально зависимы. Аспекты с Нептуном дарят яркую внешность и понимание любви через исцеление страданий."
        }
      ]
    },
    "Марс": {
      "structure": {
        "columns": [
          "id",
          "zodiac_sign",
          "description"
        ],
        "total_records": 12
      },
      "data": [
        {
          "id": 1,
          "zodiac_sign": "Овен",
          "description": "Марс — планета действия, энергии и агрессии. Она управляет стремлением и амбициями, показывает как люди добиваются своих целей. \n\nМарс в Овне может восприниматься как опасность и разрушение, но также показывает храбрость, волю и умение конкурировать. Люди с Марсом в Овне резки и прямолинейны. Они действуют быстро и не тратят время на сантименты. Марс в Овне дает лидерские качества и притягивает финансовые потоки. Люди с Марсом в Овне борются за свои права и быстро решают проблемы. Они не умеют лгать и притворяться. Марс в Овне учит сочувствию и состраданию. Дети с Марсом в Овне нуждаются в подвижных играх. Мужчины с Марсом в Овне самоуверенны и напористы. Женщины с Марсом в Овне активны и напористы. Положительные аспекты Марса с Луной гармонизируют эмоции и помогают контролировать себя. Аспекты с Меркурием дают остроумие и быстрое мышление."
        },
        {
          "id": 2,
          "zodiac_sign": "Телец",
          "description": "Марс — планета действия, энергии и агрессии. Она управляет стремлением и амбициями, показывает как люди добиваются своих целей. \n\nМарс в натальной карте отражает уровень решимости, силы воли и харизмы, но также предупреждает о потенциальных опасностях и травмах. В женском гороскопе он указывает на внешний вид и характер желаемого мужчины. В созвездии Тельца, под влиянием Венеры, Марс проявляется менее заметно, создавая образ миролюбивого и застенчивого человека. Однако накопленные эмоции могут привести к всплеску агрессии, если ущемляют его интересы. Обладатели Марса в Тельце стремятся к материальным достижениям и не боятся преодолевать преграды ради финансового благополучия, хотя обычно предпочитают более тихую и пассивную стратегию. Их стабильность и преданность, а также склонность к упрямству могут привести как к успехам, так и к кардинальным проблемам при неблагоприятных аспектах. В любви они предпочитают быть верными и преданными, но могут долго выжидать с выбором партнера, так как у них высокие требования. Энергия людей с Марсом в Тельце нацелена на материальный комфорт и уют, и они предпочитают проявлять заботу через практические действия, а не слова. Взаимодействие Марса с Венерой усиливает их страсть и творческую энергию, в то время как негативные аспекты могут привести к эмоциональным перезагрузкам."
        },
        {
          "id": 3,
          "zodiac_sign": "Близнецы",
          "description": "Марс — планета действия, энергии и агрессии. Она управляет стремлением и амбициями, показывает как люди добиваются своих целей. \n\nМарс в личном гороскопе отражает силу воли, харизму и поведение в сложных ситуациях, а в Близнецах обозначает переменчивую волю, которую может укрепить общение с успешными людьми. Носители этого аспекта могут быть вовлечены в словесные конфликты и часто выигрывают споры, используя свою риторику, но имеют трудности с доведением дел до конца. Важно сохранять спокойствие в стрессовых ситуациях и изучать влияние Марса с Меркурием, который придает им изобретательность и легкость на подъем. Люди с этим аспектом могут манипулировать словами, что как может быть к добру, так и к худу. Они часто борются за социальную справедливость, участвуя в общественной жизни, и сталкиваются с конфликтами в семейных отношениях. Дети с Марсом в Близнецах быстро усваивают знания, участвуют в соревнованиях и театральных постановках, но родителям нужно учить их сдерживать свои эмоции и корректно реагировать на сплетни. Женщина с Марсом в Близнецах стремится к идеальному партнеру и нуждается в общении для проявления любви. Она талантлива в литературе, спорте и технике, легко ладит с детьми и адаптируется к коллективу. Благоприятные аспекты Марса с Меркурием усиливают их ораторские способности и помогают достигать успеха."
        },
        {
          "id": 4,
          "zodiac_sign": "Рак",
          "description": "Марс — планета действия, энергии и агрессии. Она управляет стремлением и амбициями, показывает как люди добиваются своих целей. \n\nМарс, названный в честь бога войны, отражает качества борца, силу воли и умение справляться с трудностями. В женском гороскопе он помогает понять, какой тип мужчин привлекает обладательницу. Марс в Раке считается слабой позицией для мужчин и требует проработки. Люди с этим аспектом избегают открытых конфликтов, предчувствуя их исход, и часто страдают от притеснений. Одна из их проблем — трудность в выражении своих желаний из-за страха насмешек и обесценивания. Чтобы проработать влияние Марса, необходимо найти эмоциональную мотивацию для действий. Носители этой позиции могут болезненно реагировать на изменения традиций и имеют склонность скрывать недовольство, что негативно сказывается на здоровье. Их сексуальный потенциал раскрывается при полном доверии к партнеру. Негативные черты включают капризность и неорганизованность. Дети с Марсом в Раке могут испытывать трудности с контролем эмоций и попадают в неприятные ситуации. Обладатели этой позиции стремятся преодолеть врожденную трусость, выбирая «мужские» хобби, но внутренне ориентированы на семью. Женщины с Марсом в Раке часто ожидают идеального партнера, что может приводить к одиночеству и агрессивности. Связи Марса с Луной усиливают эмоциональную энергию натива, способствуют укреплению привязанности и созданию гармонии в отношениях."
        },
        {
          "id": 5,
          "zodiac_sign": "Лев",
          "description": "Марс — планета действия, энергии и агрессии. Она управляет стремлением и амбициями, показывает как люди добиваются своих целей. \n\nМарс, олицетворяющий бога войны, символизирует бойцовские качества, способность защищать свои интересы и уровень страстности. В женском гороскопе он помогает понять, какие мужчины привлекают ее и что нужно изменить в своем характере. Марс во Льве нейтрален, усиливая храбрость, уверенность и обаяние, но при негативных аспектах может проявлять вспыльчивость и эгоцентризм. Носители этого аспекта, обладая жизнелюбивым темпераментом, способны вдохновлять окружающих и добиваться успеха. Они обладают эмоциональной энергией и стремлением к великим целям, часто становясь знаменитыми актерами или политиками. Для успешного общения с ними важно проявлять щедрость и верность, а также быстро прощать обиды. Дети с Марсом во Льве стремятся занимать лидерские позиции благодаря обаянию и интеллекту, но им необходимо научиться справляться с интригами сверстников. Мужчина с этой позицией стремится к роскошной жизни, а женщина с Марсом во Льве мечтает о благородном рыцаре. Взаимодействие Марса с управителем Льва — Солнцем — наделяет их харизмой, силой воли и умением привлекать нужных людей. Благоприятные аспекты помогают им рационально управлять своими желаниями и достойно переносить как победы, так и поражения."
        },
        {
          "id": 6,
          "zodiac_sign": "Дева",
          "description": "Марс — планета действия, энергии и агрессии. Она управляет стремлением и амбициями, показывает как люди добиваются своих целей. \n\nМарс в натальной карте символизирует кармический уровень храбрости, стойкости, силы воли и сексуальности, а также источники опасностей, которые можно исправить. В женском гороскопе он показывает, к каким мужчинам она тянется. Марс в Деве ослаблен, а сладкие качества этого аспекта испытываются на прочность мелкими бытовыми проблемами и психологическими трудностями. Сексуальные желания подавлены из-за боязливого характера, тогда как стремление к покупке дорогих вещей побуждает к усиленной работе и строительству карьеры. Носители этого положения — перфекционисты, которые тщательно планируют, но могут зацикливаться на деталях, теряя общее видение целей. Это делает их хорошими интриганами и журналистами, однако жажда совершенства мешает им завершать дела. Дети с Марсом в Деве могут быть застенчивыми, но обладают богатым внутренним миром. Мужчина с этой позицией трудолюбив, но боится отказа, поэтому долго собирается с духом, чтобы проявить симпатию. Женщина с Марсом в Деве трудоспособна, легко усваивает информацию и подходит для работы в точных науках. Благоприятные аспекты с Меркурием дают им интеллект и ораторские способности, тогда как негативные могут привести к сарказму и злословию."
        },
        {
          "id": 7,
          "zodiac_sign": "Весы",
          "description": "Марс — планета действия, энергии и агрессии. Она управляет стремлением и амбициями, показывает как люди добиваются своих целей. \n\nМарс в Весах придает нативу стремление к соавторству и сотрудничеству, поскольку он ощущает себя некомфортно в одиночестве и добивается успеха в компании единомышленников. Подопечные Марса в Весах могут долго обдумывать свои поступки, но в итоге часто принимают импульсивные решения, поддаваясь эмоциям. Они характеризуются внутренними противоречиями: дружелюбие может сменяться холодным высокомерием или гневом, а стремление к романтике — физической привлекательностью, что порождает сложности в отношениях. Люди с Марсом в Весах наслаждаются спорами и дискуссиями, но часто принимают интересы партнера за свои, что затрудняет определение личных целей. В любви они могут проявлять страсть, но испытывают трудности с обязательствами, иногда вступая в поспешные браки. При этом они ценят эстетическую красоту и стремятся к гармонии, что делает их отличными партнерами для артистичных и интеллектуальных людей. Гармоничные аспекты с Венерой усиливают их привлекательность, в то время как напряженные аспекты могут привести к трудностям в отношениях и неопределенности в самовыражении."
        },
        {
          "id": 8,
          "zodiac_sign": "Скорпион",
          "description": "Марс — планета действия, энергии и агрессии. Она управляет стремлением и амбициями, показывает как люди добиваются своих целей. \n\nОбладатели Марса в Скорпионе часто ведут активную борьбу с рутиной, притягивая конфликты и неприятности даже в спокойной обстановке. Их интерес к смерти, оккультным практикам и экстримам проявляется в стремлении проверять на практике рискованные теории и испытания. Эти люди обладают сильной волей, смелостью и настойчивостью, что помогает им добиваться своих целей, но их агрессивность и властные наклонности могут приводить к конфликтам, особенно в отношениях. В любви они страстны и романтичны, предпочитая загадочных и умных партнерш, однако могут быть склонны к контролю и ревности. Важно, чтобы они научились управлять своими инстинктами и эмоциями, так как их скрытность и одержимость могут вести к проблемам в отношениях и жизни в целом. Сильные аспекты с другими планетами усиливают их положительные качества, но негативные могут привести к серьезным травмам или конфликтам, особенно в ситуациях, связанных с риском."
        },
        {
          "id": 9,
          "zodiac_sign": "Стрелец",
          "description": "Марс — планета действия, энергии и агрессии. Она управляет стремлением и амбициями, показывает как люди добиваются своих целей. \n\nМарс в Стрельце наделяет людей независимостью и стремлением к свободе, сочетая дружелюбие с непоколебимостью в своих принципах. Эти натуры часто становятся лидерами оппозиции, с дерзкими речами и критическим подходом к властям, что помогает им находить поддержку среди друзей и единомышленников. Они проявляют оптимизм, авантюризм и любовь к приключениям, однако их физическая сила и вспыльчивость могут вызывать конфликты. Носители Марса в Стрельце активны в любви, предпочитая легкость в отношениях и отсутствие социальных условностей. Брак обычно наступает поздно, и партнер должен разделять их философские и духовные ценности. Успех в карьере может быть обеспечен благодаря благоприятным аспектам с Юпитером, но негативные аспекты могут приводить к эгоцентризму и жажде удовольствий. В целом, люди с этим положением планеты — энергичные, оптимистичные идеалисты, стремящиеся к новым горизонтам, но иногда они страдают от недостатка настойчивости и фокусировки на своих целях."
        },
        {
          "id": 10,
          "zodiac_sign": "Козерог",
          "description": "Марс — планета действия, энергии и агрессии. Она управляет стремлением и амбициями, показывает как люди добиваются своих целей. \n\nОбладатели Марса в Козероге отличаются высокой работоспособностью и целеустремленностью, стремясь преодолеть трудности на пути к успеху и не останавливаясь на достигнутом. Внешне спокойные и невозмутимые, они воспринимают проявления гнева как слабость и легко прекращают отношения с неприятными людьми. Сильное стремление к карьерному росту и получение наград подталкивает их к саморазвитию и созданию трудных ситуаций для самопроверки. В личной жизни они могут быть сдержанными и практичными, предпочитая стабильные отношения с успешными партнерами. Под влиянием Сатурна их дисциплина и организованность могут проявляться как склонность к злопамятству и упрямству. При этом они часто становятся трудоголиками, способными на большие достижения, если научатся контролировать свою раздражительность и не позволят негативным эмоциям мешать успеху."
        },
        {
          "id": 11,
          "zodiac_sign": "Водолей",
          "description": "Марс — планета действия, энергии и агрессии. Она управляет стремлением и амбициями, показывает как люди добиваются своих целей. \n\nОбладатели Марса в Водолее являются энергичными и независимыми индивидуумами, отстаивающими гуманистические идеалы, однако они часто не вникают в личные проблемы других. Их оригинальные и иногда эксцентричные идеи направлены на прогресс и разрушение традиционных стереотипов. Эти люди склонны к бунту против общественных норм, что делает их не только артистичными, но и вдохновляющими в науке и искусстве. Под влиянием этой позиции они могут проявлять агрессивность, но часто скрывают ее под маской доброжелательности. В личных отношениях они предпочитают свободу и равенство, иногда испытывая трудности с эмоциональной привязанностью. Марс в Водолее наделяет их креативностью и желанием экспериментировать, что может привести к неожиданным поворотам и скандалам. Несмотря на то, что их яркая индивидуальность и нестандартный подход к жизни делают их интересными, иногда они сталкиваются с трудностями в межличностных отношениях из-за своей непостоянности и резкости."
        },
        {
          "id": 12,
          "zodiac_sign": "Рыбы",
          "description": "Марс — планета действия, энергии и агрессии. Она управляет стремлением и амбициями, показывает как люди добиваются своих целей. \n\nОбладатели Марса в Рыбах характеризуются уникальной способностью к плетению интриг и глубоким пониманием человеческой психологии, что позволяет им распознавать лжецов и избегать манипуляций. Эти люди, часто интроверты с творческими наклонностями, способны на значительные поступки в моменты стресса или сильной заинтересованности, однако обычно предпочитают оставлять вопросы справедливости высшим силам. Их философия и мистика определяют их жизнь, однако они могут быть непостоянными и небрежными в повседневных делах. Часто стремятся к самосовершенствованию, но могут столкнуться с трудностями в четком планировании и реализации своих желаний. В отношениях они обаятельны и романтичны, но иногда привлекают манипуляторов, которые используют их доброту в своих интересах. Марс в Рыбах наделяет этих людей интуицией и творческим воображением, однако они должны учиться контролировать свои эмоции и избегать излишней зависимости от удовольствий, чтобы избежать проблем с самодисциплиной."
        }
      ]
    },
    "Юпитер": {
      "structure": {
        "columns": [
          "id",
          "zodiac_sign",
          "description"
        ],
        "total_records": 12
      },
      "data": [
        {
          "id": 1,
          "zodiac_sign": "Овен",
          "description": "Юпитер — планета, которая символизирует рост, изобилие, процветание и удачу. Она отвечает за духовно-интеллектуальное развитие, побуждает людей искать смысл жизни.\n\nЮпитер в Овне усиливает амбиции, энергию и стремление к достижениям. В начале знака это проявляется в активных действиях, а в конце — в духовных поисках. Планета придает огненной энергии Овна духовный смысл, побуждая к защите слабых и борьбе за справедливость. Натив может проявлять уверенность в своей компетентности, что иногда перерастает в высокомерие. Юпитер в Овне наделяет щедростью, оптимизмом, лидерскими способностями и актерским талантом, но также склонностью к импульсивности, тщеславию и диктаторским замашкам при неблагоприятных аспектах. Мужчины с Юпитером в Овне харизматичны и решительны, но непостоянны в любви. Женщины амбициозны, ценят интеллект и власть, часто конкурируют с мужчинами. Оба пола стремятся к лидерству и успеху, но могут быть нетерпимы и эгоцентричны. Гармоничные аспекты с Марсом усиливают смелость и амбиции, в то время как негативные аспекты с Марсом и Сатурном могут привести к эгоизму и тирании."
        },
        {
          "id": 2,
          "zodiac_sign": "Телец",
          "description": "Юпитер — планета, которая символизирует рост, изобилие, процветание и удачу. Она отвечает за духовно-интеллектуальное развитие, побуждает людей искать смысл жизни.\n\nЮпитер в Тельце формирует у человека уверенность в своей правоте, практичный подход к жизни и склонность к долгому обдумыванию решений. Натив ценит материальные блага, комфорт и роскошь, что побуждает его к трудолюбию и управлению финансами, часто приводя к успеху и богатству. Он щедр, но предусмотрителен, любит наслаждаться жизнью и искусством, особенно музыкой, и редко рискует. Основные черты характера — стойкость, терпение и забота о благополучии близких. При поражении планеты могут проявляться жадность, скупость и вредные привычки."
        },
        {
          "id": 3,
          "zodiac_sign": "Близнецы",
          "description": "Юпитер — планета, которая символизирует рост, изобилие, процветание и удачу. Она отвечает за духовно-интеллектуальное развитие, побуждает людей искать смысл жизни.\n\nЮпитер в Близнецах наделяет человека любознательностью, блестящими коммуникативными навыками и способностью быстро усваивать информацию. Натив постоянно стремится к обучению и обмену знаниями, легко заводит полезные связи, что помогает ему в карьере и личной жизни. Ораторский талант, изобретательность и способность находить нестандартные решения способствуют успеху в таких сферах, как СМИ, дипломатия, наука и искусство. Однако поверхностность и нерешительность могут мешать долгосрочному успеху, особенно при отсутствии дисциплины и ответственности."
        },
        {
          "id": 4,
          "zodiac_sign": "Рак",
          "description": "Юпитер — планета, которая символизирует рост, изобилие, процветание и удачу. Она отвечает за духовно-интеллектуальное развитие, побуждает людей искать смысл жизни.\n\nЮпитер в Раке наделяет людей ярким воображением, амбициями и стремлением к успеху в сферах искусства, медицины или бизнеса. Они тянутся к познанию новых культур, но настоящий успех часто приходит в родных местах, где они сохраняют традиции и могут стать послами своей культуры. Семейные ценности, милосердие и любовь к ближним играют важную роль в их жизни. Мужчины с Юпитером в Раке — заботливые и щедрые, для которых семья и дом важнее всего. Женщины сентиментальны, романтичны и заботливы, стремятся к созданию уюта и гармонии. Оба пола достигают успеха благодаря поддержке семьи и близких. Гармоничные аспекты с Луной усиливают интуицию и доброту, а с Венерой приносят удачу в любви и браке. Напряженные аспекты могут вызывать капризы, эмоциональные проблемы и тягу к излишествам."
        },
        {
          "id": 5,
          "zodiac_sign": "Лев",
          "description": "Юпитер — планета, которая символизирует рост, изобилие, процветание и удачу. Она отвечает за духовно-интеллектуальное развитие, побуждает людей искать смысл жизни.\n\nЮпитер во Льве дарует нативу харизму, благородство, амбиции и стремление к славе. Такие люди обладают организаторскими способностями, сильным творческим потенциалом и уверенностью в своей исключительности, что делает их заметными и притягательными. Они любят быть в центре внимания и окружены признанием, однако при поражении планеты склонны к высокомерию, расточительности и эгоизму. Для достижения успеха важно балансировать между духовным развитием и стремлением к внешнему блеску, избегая тщеславия и излишней показушности."
        },
        {
          "id": 6,
          "zodiac_sign": "Дева",
          "description": "Юпитер — планета, которая символизирует рост, изобилие, процветание и удачу. Она отвечает за духовно-интеллектуальное развитие, побуждает людей искать смысл жизни.\n\nЮпитер в Деве наделяет человека практичностью, трудолюбием и стремлением к совершенству. Обладатели этой позиции всегда нацелены на улучшение себя и окружающих, часто работая над деталями и мелочами. Успех приходит через упорный труд, внимание к деталям и практическое применение знаний. При этом Юпитер в Деве лишен мечтательности и предпочитает проверенные методы. Мужчины с Юпитером в Деве внимательны к мелочам и критичны к близким, ожидая совершенства. Женщины часто совмещают саркастичное остроумие с сомнениями и пессимизмом, но проявляют честолюбие и стремление к порядку. Гармоничные аспекты с Венерой и Луной смягчают их сухость и педантичность, усиливая доброжелательность и внимание к чувствам других. Главные минусы этой позиции — склонность к чрезмерной критике, пессимизму и трудности в принятии чужого мнения."
        },
        {
          "id": 7,
          "zodiac_sign": "Весы",
          "description": "Юпитер — планета, которая символизирует рост, изобилие, процветание и удачу. Она отвечает за духовно-интеллектуальное развитие, побуждает людей искать смысл жизни.\n\nЮпитер в Весах наделяет натива обаянием, дипломатичностью и чувством справедливости. Успех приходит через гармонию, искусство, умение решать конфликты и работать в команде. Такие люди обладают тонким вкусом и стремятся окружить себя культурными и образованными людьми. Однако стремление угодить всем может привести к нарушениям закона и внутренним конфликтам. Они успешны в сферах искусства, политики, педагогики и шоу-бизнеса, но могут страдать от нерешительности и боязни ссор. В отношениях ценят красоту и гармонию, но могут использовать брак для повышения социального статуса."
        },
        {
          "id": 8,
          "zodiac_sign": "Скорпион",
          "description": "Юпитер — планета, которая символизирует рост, изобилие, процветание и удачу. Она отвечает за духовно-интеллектуальное развитие, побуждает людей искать смысл жизни.\n\nЮпитер в Скорпионе наделяет натива сильной интуицией, страстью к власти и стремлением к финансовой свободе. Он обладает магнетизмом, проницательностью и талантом в управлении ресурсами и людьми. Успех приходит через использование тайных знаний, а также в сфере политики, финансов, медицины и права. В негативе проявляются властолюбие, алчность и склонность к интригам. Для достижения гармонии важно контролировать разрушительные порывы и использовать свои силы для благих целей, направленных на трансформацию и восстановление справедливости."
        },
        {
          "id": 9,
          "zodiac_sign": "Стрелец",
          "description": "Юпитер — планета, которая символизирует рост, изобилие, процветание и удачу. Она отвечает за духовно-интеллектуальное развитие, побуждает людей искать смысл жизни.\n\nЮпитер в Стрельце дарует нативу любовь к свободе, приключениям и духовному развитию. Такой человек стремится к высокому социальному статусу не ради славы, а для реализации своих амбиций и интересов. Он оптимистичен, независим, амбициозен и открыт новым знаниям, активно участвует в общественной жизни и любит путешествовать. Удача зависит от активности и энтузиазма. Негативные черты включают склонность к азартным играм, самодовольству и прямолинейности. В отношениях обладатель Юпитера в Стрельце щедр и харизматичен, привлекает внимание благодаря своей уверенности и любви к жизни."
        },
        {
          "id": 10,
          "zodiac_sign": "Козерог",
          "description": "Юпитер — планета, которая символизирует рост, изобилие, процветание и удачу. Она отвечает за духовно-интеллектуальное развитие, побуждает людей искать смысл жизни.\n\nЮпитер в Козероге формирует характер, стремящийся к власти, амбициям и достижениям, что требует развития силы воли и выдержки. Натив рассматривает законы как инструменты для реализации своих амбициозных целей, что может привести к конфликтам с моральными и этическими нормами. Основные черты этого положения включают проницательность, организованность, ответственность и честолюбие, но также эмоциональную холодность и склонность к скупости. Юпитер в Козероге придает нативу стратегическое мышление и талант к управлению, однако стремление к успеху может затмить личные отношения и привести к изоляции. Люди с этой позицией могут быть жесткими и прямолинейными, что делает их отличными организаторами, но доверие к ним необходимо заслужить. Для гармоничного развития важно поддерживать баланс между Юпитером и Сатурном, развивая чувство долга и справедливости. Негативные аспекты могут приводить к финансовым трудностям, но поддержка других планет помогает преодолеть препятствия. В целом, такие люди могут достичь значительных высот, если будут придерживаться честных и гуманных принципов в своих действиях."
        },
        {
          "id": 11,
          "zodiac_sign": "Водолей",
          "description": "Юпитер — планета, которая символизирует рост, изобилие, процветание и удачу. Она отвечает за духовно-интеллектуальное развитие, побуждает людей искать смысл жизни.\n\nЮпитер в Водолее способствует духовному росту через отделение истины от лжи, даруя нативу развитую интуицию и понимание психологии, что помогает разбираться в религиозных и философских концепциях. Это сочетание часто ведет к стремлению защищать новые идеи и реформы, но может разрушать личные отношения ради высоких идеалов. Ключевыми чертами являются дружелюбие, щедрость и креативность, но могут проявляться легкомысленность и бестактность. Успех приходит, когда натив соединяет оригинальность мышления с мудростью. Мужчина с этой позицией использует слово для достижения власти, а женщина привлекает своей независимостью и оригинальностью. Благоприятные аспекты с Солнцем и Луной способствуют значимому успеху в обществе, тогда как квадратура с Ураном может привести к эксцентричному поведению. Люди с Юпитером в Водолее гуманитарны и стремятся к реформам, обладая хорошими коммуникативными навыками, что делает их успешными в дипломатии и менеджменте."
        },
        {
          "id": 12,
          "zodiac_sign": "Рыбы",
          "description": "Юпитер — планета, которая символизирует рост, изобилие, процветание и удачу. Она отвечает за духовно-интеллектуальное развитие, побуждает людей искать смысл жизни.\n\nЮпитер в Рыбах наделяет людей мистицизмом и стремлением к поиску тайн, что может привести к мечтам о могуществе, но без реальных действий для их осуществления. Нативы исследуют оккультные науки и могут погружаться в иллюзии, теряя интерес к реальности, однако их артистические способности в живописи, музыке и литературе служат источником вдохновения. Важные качества включают доброту, сопереживание и глубокое понимание эмоций окружающих, а также талант к предвидению и помощи другим. При этом возможны негативные черты, такие как лень, мечтательность и склонность к жертвенности. Люди с Юпитером в Рыбах часто становятся добрыми семьянинами, предпочитающими домашний уют и благотворительность, и нуждаются в высокодуховных партнерах. Гармоничные аспекты с другими планетами, особенно с Нептуном и Луной, помогают раскрыть их творческий потенциал и способствуют успеху в искусстве, тогда как негативные аспекты могут привести к эмоциональной уязвимости и использованию манипуляций."
        }
      ]
    },
    "Сатурн": {
      "structure": {
        "columns": [
          "id",
          "zodiac_sign",
          "description"
        ],
        "total_records": 12
      },
      "data": [
        {
          "id": 1,
          "zodiac_sign": "Овен",
          "description": "Сатурн — планета дисциплины, ответственности и упорного труда. Она освещает человеческие страхи и ограничения, а также показывает, как люди справляются с трудностями. \n\nСатурн в Овне требует от человека учиться на ошибках и быстро расплачиваться за импульсивные поступки. Конфликты и ограничения, особенно в отношениях с родителями и партнерами, способствуют формированию стойкости и самодисциплины. Такие люди могут стать как агрессивными лидерами, подавляющими других, так и целеустремленными управленцами, если направят свою энергию на достижение целей. Снятие напряжения лучше всего происходит через спорт. Отношения с отцами у людей с Сатурном в Овне часто сложные, а в личной жизни проявляется стремление к доминированию."
        },
        {
          "id": 2,
          "zodiac_sign": "Телец",
          "description": "Сатурн — планета дисциплины, ответственности и упорного труда. Она освещает человеческие страхи и ограничения, а также показывает, как люди справляются с трудностями. \n\nСатурн в Тельце наделяет человека выносливостью, терпением и стремлением к материальной стабильности. Такие люди часто становятся хорошими организаторами, следуют установленным правилам и стремятся к финансовой независимости. Они медленно, но уверенно достигают целей, предпочитают стабильную работу и эмоциональное спокойствие в отношениях. В личной жизни сдержанны, редко показывают свои чувства и чаще всего вступают в брак после 30 лет. Возможные проблемы: чрезмерная привязанность к материальному, скупость и страх потерять стабильность."
        },
        {
          "id": 3,
          "zodiac_sign": "Близнецы",
          "description": "Сатурн — планета дисциплины, ответственности и упорного труда. Она освещает человеческие страхи и ограничения, а также показывает, как люди справляются с трудностями. \n\nСатурн в Близнецах делает натива избирательным в общении — он предпочитает практичные контакты, избегая пустых разговоров. Обладатели Сатурна в этом знаке дисциплинированны в умственной работе, логичны и организованы, но могут быть склонны к сомнениям. Их отношения с близкими, особенно братьями, сестрами и детьми, часто сложные. Они боятся критики, скрывают личные секреты и контролируют эмоции. При благоприятных аспектах с Меркурием улучшаются обучаемость и коммуникации, а напряженные аспекты могут привести к замкнутости, болезням легких и эмоциональным проблемам."
        },
        {
          "id": 4,
          "zodiac_sign": "Рак",
          "description": "Сатурн — планета дисциплины, ответственности и упорного труда. Она освещает человеческие страхи и ограничения, а также показывает, как люди справляются с трудностями. \n\nСатурн в Раке часто приводит к неуверенности и сомнениям, что мешает успеху без поддержки сильных союзников. Нативы растут в эмоционально холодной атмосфере, что формирует нерешительность, стеснительность и склонность к меланхолии. Им важно учиться проявлять чувства, но они часто скрывают свои эмоции, опасаясь отказа. В личной жизни эти люди могут вступать в брак по указанию семьи, даже если не чувствуют любви. Они хозяйственны и экономны, но страдают от внутреннего страха перед потерей. Гармоничные аспекты с Солнцем и Луной помогают смягчить эти черты, а напряженные аспекты усиливают чувство неполноценности и эмоциональные проблемы."
        },
        {
          "id": 5,
          "zodiac_sign": "Лев",
          "description": "Сатурн — планета дисциплины, ответственности и упорного труда. Она освещает человеческие страхи и ограничения, а также показывает, как люди справляются с трудностями. \n\nСатурн во Льве ограничивает самовыражение, несмотря на природные таланты в искусстве и лидерстве. Люди с таким положением часто сталкиваются с проблемами признания и успеха, зависимы от одобрения и страдают от стеснительности и гордыни. Они амбициозны, но стремление к власти и признанию может приводить к конфликтам и напряженным отношениям с детьми и коллегами. В личной жизни им нужно восхищение и поддержка партнера. Гармоничные аспекты с Солнцем помогают раскрыть лидерские качества, а напряженные усиливают комплексы и страхи."
        },
        {
          "id": 6,
          "zodiac_sign": "Дева",
          "description": "Сатурн — планета дисциплины, ответственности и упорного труда. Она освещает человеческие страхи и ограничения, а также показывает, как люди справляются с трудностями. \n\nСатурн в Деве делает человека дисциплинированным, трудолюбивым и ответственным. Такие люди требуют порядка и строгости от себя и окружающих, но часто зацикливаются на мелочах, что может приводить к тревожности и занудству. Люди с таким положением склонны к перфекционизму, но должны научиться отличать важное от второстепенного, чтобы достичь успеха. В личной жизни они придирчивы, ценят стабильность и требуют от партнера соответствия высоким стандартам, особенно в материальном плане. Любовь воспринимают через призму рациональности и дисциплины."
        },
        {
          "id": 7,
          "zodiac_sign": "Весы",
          "description": "Сатурн — планета дисциплины, ответственности и упорного труда. Она освещает человеческие страхи и ограничения, а также показывает, как люди справляются с трудностями. \n\nСатурн в Весах наделяет обаянием, умом и стремлением к справедливости. Такие люди преуспевают в юриспруденции, искусстве и дипломатии, но могут скатиться в пессимизм без вдохновляющих целей. Им важно создавать гармонию вокруг себя и сотрудничать с коллективом. Однако они склонны к чрезмерной требовательности и часто выбирают брак по расчету. В личной жизни могут быть сложности из-за конфликта между разумом и чувствами, а поздние браки часто основываются на практических соображениях."
        },
        {
          "id": 8,
          "zodiac_sign": "Скорпион",
          "description": "Сатурн — планета дисциплины, ответственности и упорного труда. Она освещает человеческие страхи и ограничения, а также показывает, как люди справляются с трудностями. \n\nСатурн в Скорпионе испытывает натива трудностями, формируя силу воли, выдержку и амбиции. Люди с таким положением планеты обладают харизмой и сильной энергетикой. Они преуспевают в руководящих позициях, но их склонность к мстительности и тщеславию может мешать развитию. В личной жизни они страстные, но скрытные, часто выбирают партнера с трудной судьбой. Гармоничные аспекты с Плутоном усиливают проницательность, а напряженные — провоцируют драматизм."
        },
        {
          "id": 9,
          "zodiac_sign": "Стрелец",
          "description": "Сатурн — планета дисциплины, ответственности и упорного труда. Она освещает человеческие страхи и ограничения, а также показывает, как люди справляются с трудностями. \n\nСатурн в Стрельце часто проявляется у борцов за свободу, придавая им идеализм и стремление к справедливости, но также налагая кармическую задачу избегать фанатизма и навязывания своих убеждений. Нативы с этой позицией обладают выдающимся интеллектом, памятью и экстрасенсорными способностями, но могут страдать от зависимостей к одобрению и похвале. В личной жизни они предпочитают партнеров, которые разделяют их идеалы, часто сталкиваются с обманом и имеют сложности в доверительных отношениях. Гармоничные аспекты с Меркурием и Венерой усиливают их ораторские способности и чувственность, тогда как негативные могут привести к манипуляциям. Для них важны медитация и самоанализ, но необходимо остерегаться циничности и чрезмерной амбициозности. Проблемы со здоровьем могут проявляться в плохом кровообращении, поэтому рекомендуется заниматься физической активностью и проводить время на свежем воздухе."
        },
        {
          "id": 10,
          "zodiac_sign": "Козерог",
          "description": "Сатурн — планета дисциплины, ответственности и упорного труда. Она освещает человеческие страхи и ограничения, а также показывает, как люди справляются с трудностями. \n\nСатурн в Козероге заставляет носителя ценить людей не по статусу, а по душевным качествам, что важно для его личного роста. Холодная семейная атмосфера и требовательные родители формируют у нативов ориентир на материальные достижения. Сильные стороны Сатурна в Козероге включают терпение, трудолюбие и лидерские качества, но также могут проявляться недостаток чувства юмора и склонность к эгоизму. В личной жизни такие люди выбирают партнеров по схожим целям и достижениям, но часто оказываются неумелыми в ухаживании и демонстрации эмоций. Брак для них важен, но вступают в него поздно, тщательно оценивая будущего спутника. Гармоничное развитие зависит от положительных аспектов с Солнцем и Луной, а негативные связи с Марсом и Луной могут вызывать конфликты."
        },
        {
          "id": 11,
          "zodiac_sign": "Водолей",
          "description": "Сатурн — планета дисциплины, ответственности и упорного труда. Она освещает человеческие страхи и ограничения, а также показывает, как люди справляются с трудностями. \n\nСатурн в Водолее способствует креативности и упорядочению идей, особенно если Солнце и Асцендент находятся в земных знаках. Нативы обладают пытливым умом, феноменальной памятью и талантом к изучению знаковых систем, но могут столкнуться с трудностями в первой половине жизни из-за излишней доверчивости. Им важно развивать социальные навыки и ответственность, чтобы избежать разочарований. Личная жизнь часто страдает из-за стремления к высоким идеалам, и семья создается после 30 лет, когда нативы уже погружены в свою работу и общественные дела. В браке могут возникать проблемы из-за эмоционального эгоизма и недостатка внимания к партнеру. Успех приходит в политике и творчестве при поддержке других планет."
        },
        {
          "id": 12,
          "zodiac_sign": "Рыбы",
          "description": "Сатурн — планета дисциплины, ответственности и упорного труда. Она освещает человеческие страхи и ограничения, а также показывает, как люди справляются с трудностями. \n\nСатурн в Рыбах может вызывать проблемы с психикой и нервной системой, особенно при слабых Луне и Нептуне, но при правильной проработке приносит мощную мистическую силу. Люди с таким положением становятся творцами своей реальности, обладая талантами целителей, психотерапевтов и артистов, если избегают таких темных искушений, как интриги и мошенничество. Их кармическая задача заключается в соблюдении честности и моральных норм, поскольку нарушения могут привести к страданиям и конфликтам. В личной жизни они ищут идеальных партнеров, но часто сталкиваются с разочарованиями из-за нереалистичных ожиданий и склонности обвинять других в своих неудачах. Гармоничные аспекты с Нептуном и Венерой могут способствовать эмоциональной стабильности. Важно развивать веру в себя и обучаться на собственном опыте, чтобы преодолеть свои внутренние ограничения."
        }
      ]
    },
    "Уран": {
      "structure": {
        "columns": [
          "id",
          "zodiac_sign",
          "description"
        ],
        "total_records": 12
      },
      "data": [
        {
          "id": 1,
          "zodiac_sign": "Овен",
          "description": "Уран — планета индивидуальности, новаторства и нестандартного мышление. Она отвечает за человеческую потребность в стремлении к свободе, а также раскрывает уникальный характер людей.\n\nУран в Овне создает мощный импульс к действию и переменам. Энергия Овна наполняет натива стремлением к свободе и обновлению, порождая решимость разрушать старые традиции и вводить новшества. Это положение делает человека первопроходцем и революционером, способным генерировать неожиданные идеи и совершать значимые подвиги. Такой человек проявляет смелость, порой переходящую в безрассудство, и стремится к лидерству."
        },
        {
          "id": 2,
          "zodiac_sign": "Телец",
          "description": "Уран — планета индивидуальности, новаторства и нестандартного мышление. Она отвечает за человеческую потребность в стремлении к свободе, а также раскрывает уникальный характер людей.\n\nУран в Тельце символизирует консервативный подход к жизни. Телец, ассоциирующийся с надежностью и стабильностью, делает человека менее склонным к переменам. Натив предпочитают традиционные ценности. Уран создает внутренний конфликт: человек испытывает недоверие к новым веяниям и остается верными мудрости предков. Риск пугает, и натив находит комфорт в проверенных временем методах. Он часто вспоминает прошлое и уважает идеалы стабильности и традиций."
        },
        {
          "id": 3,
          "zodiac_sign": "Близнецы",
          "description": "Уран — планета индивидуальности, новаторства и нестандартного мышление. Она отвечает за человеческую потребность в стремлении к свободе, а также раскрывает уникальный характер людей.\n\nУран в Близнецах дарит живой и изобретательный ум, способный быстро реагировать на изменения. Эта позиция способствует развитию новых форм мышления и созданию оригинальных концепций в науке и литературе. Натив мастерски осваивает новые способы передачи информации и активно работает с идеями, которые могут изменить взгляды на жизнь. Оптимизм и игривость делают человека с таким положением новатором в мире информации, и он любит шокировать окружающих новыми сенсациями."
        },
        {
          "id": 4,
          "zodiac_sign": "Рак",
          "description": "Уран — планета индивидуальности, новаторства и нестандартного мышление. Она отвечает за человеческую потребность в стремлении к свободе, а также раскрывает уникальный характер людей.\n\nУран в Раке создает особую связь с корнями, родиной и природой. Натив рассматривает современные достижения цивилизации как уход от истинной гармонии, ища мудрость предков в сочетании с природными законами. Традиционные ценности важны для человека, и он чувствует, что современный образ жизни лишь отвлекает его от подлинного счастья. Философия людей с таким положением основана на понимании, что раньше было лучше, и они собирают знания о древних истинах, отвергая новые идеалы."
        },
        {
          "id": 5,
          "zodiac_sign": "Лев",
          "description": "Уран — планета индивидуальности, новаторства и нестандартного мышление. Она отвечает за человеческую потребность в стремлении к свободе, а также раскрывает уникальный характер людей.\n\nУран во Льве вдохновляет на создание и следование традиционным праздникам и ритуалам. Натив видит в них нечто священное и важное, что передавалось из поколения в поколение. Уран здесь наделяет его страстью к празднованию жизни, и он считает, что следование установленным традициям приносит счастье. Человеку не нужны новые обряды, когда уже существует множество продуманных и значимых ритуалов. Его жизнь наполнена праздниками и весельем, основанными на мудрости предков."
        },
        {
          "id": 6,
          "zodiac_sign": "Дева",
          "description": "Уран — планета индивидуальности, новаторства и нестандартного мышление. Она отвечает за человеческую потребность в стремлении к свободе, а также раскрывает уникальный характер людей.\n\nУран в Деве направляет энергию в сферу науки и технологий. Человек с таким положением генерирует инновационные идеи, которые могут значительно продвинуть технический прогресс. Эта позиция заставляет работать над новыми технологиями и устройствами: от компьютеров до мобильных гаджетов. Страсть к деталям и усердие в работе приводят к тому, что натив становится двигателем прогресса в своей области, внося вклад в развитие науки и техники."
        },
        {
          "id": 7,
          "zodiac_sign": "Весы",
          "description": "Уран — планета индивидуальности, новаторства и нестандартного мышление. Она отвечает за человеческую потребность в стремлении к свободе, а также раскрывает уникальный характер людей.\n\nУран в Весах открывает новые горизонты в вопросах гармонии и равновесия. Натив ищет свежие идеи в партнерских отношениях и общественном взаимодействии, стремится к новым эстетическим и моральным нормам. Убеждения о свободе и равенстве формируют взгляды человека на мир, и он может проявить себя как поэт, художник или писатель, который хочет показать, что жизнь может быть прекрасной и сбалансированной. Он стремится к новому пониманию гармонии в отношениях."
        },
        {
          "id": 8,
          "zodiac_sign": "Скорпион",
          "description": "Уран в Скорпионе наделяет страстью к переменам и отвержением устаревших традиций. Натив обладает сильным стремлением к разрушению старого ради создания нового, что приводит к поиску инновационных идей для улучшения качества жизни. Это положение вызывает интерес к как личным преобразованиям, так и глобальным. Он готов погрузиться в глубины изменений и активно искать способы улучшения жизни и себя."
        },
        {
          "id": 9,
          "zodiac_sign": "Стрелец",
          "description": "Уран — планета индивидуальности, новаторства и нестандартного мышление. Она отвечает за человеческую потребность в стремлении к свободе, а также раскрывает уникальный характер людей.\n\nУран в Стрельце открывает новые перспективы в идеологии и религии. Человик с таким положением стремится обновить представления о морали, нравственности и вере, что ведет к поиску новых учений и философий. Эта позиция вызывает революционные изменения в мировоззрении, что может приводить к возникновению новых общественных движений. Он видит светлое будущее, где новые идеи становятся основой для счастья и гармонии для всех."
        },
        {
          "id": 10,
          "zodiac_sign": "Козерог",
          "description": "Уран — планета индивидуальности, новаторства и нестандартного мышление. Она отвечает за человеческую потребность в стремлении к свободе, а также раскрывает уникальный характер людей.\n\nУран в Козероге акцентирует внимание на новаторских подходах к заработку и трудовой деятельности. Натив стремится к созданию новых профессий и методов работы, которые бросают вызов традиционным взглядам на труд. Эта позиция вдохновляет его искать уникальные способы заработка, что может проявляться в разных сферах: от сельского хозяйства до бизнеса. Он — новатор, готовый использовать новые методы и технологии, чтобы улучшить свою жизнь и жизнь окружающих."
        },
        {
          "id": 11,
          "zodiac_sign": "Водолей",
          "description": "Уран — планета индивидуальности, новаторства и нестандартного мышление. Она отвечает за человеческую потребность в стремлении к свободе, а также раскрывает уникальный характер людей.\n\nУран в Водолее символизирует дружелюбие и гуманность, сочетая новаторский подход с уважением к традициям. Натив стремится к свободе и справедливости, видя новые идеи, которые могут улучшить жизнь общества.Оригинальные идеи и стремление к гуманизму делают его человеком, который желает приносить добро и счастье другим. Он понимает, что новизна и традиции могут сосуществовать, создавая баланс, необходимый для гармоничного функционирования общества."
        },
        {
          "id": 12,
          "zodiac_sign": "Рыбы",
          "description": "Уран — планета индивидуальности, новаторства и нестандартного мышление. Она отвечает за человеческую потребность в стремлении к свободе, а также раскрывает уникальный характер людей.\n\nУран в Рыбах приносит свободу в вопросах веры и отношений. Человек с таким положением выступает за полное освобождение в любви и сексуальности, считая, что каждый имеет право следовать своим желаниям. Его жизнь наполнена идеалами свободы, и он стремится разрушить любые ограничения, касающиеся любви и личной свободы. Он — борец за права в сфере любви и сексуальности, веря, что истинная любовь не знает преград и свободна в своем выражении."
        }
      ]
    },
    "Нептун": {
      "structure": {
        "columns": [
          "id",
          "zodiac_sign",
          "description"
        ],
        "total_records": 12
      },
      "data": [
        {
          "id": 1,
          "zodiac_sign": "Овен",
          "description": "Нептун — это планета воображения и мечтаний. Она влияет на эмоциональную и духовную восприимчивость людей, освещая их творческие способности и связь с чем-то, что выходит за пределы материального мира.\n\nЛюди с Нептуном в Овне не боятся конфликтов и даже могут создавать их, если это помогает им достичь их целей. Эти индивиды выступают в роли духовных рыцарей, борясь за свои идеалы с огромным убеждением. Они склонны разрушать старые религиозные и политические убеждения, внося новые идеи."
        },
        {
          "id": 2,
          "zodiac_sign": "Телец",
          "description": "Нептун — это планета воображения и мечтаний. Она влияет на эмоциональную и духовную восприимчивость людей, освещая их творческие способности и связь с чем-то, что выходит за пределы материального мира.\n\nЛюди с Нептуном в Тельце стремятся к богатству, что делает их очень чувствительными к деньгам и ценным активам. Они обладают превосходным чутьем на финансовые возможности, что может приводить к поиску золота и драгоценных камней или к появлению прибыльных бизнес-идей. Эти люди также имеют дар превращать любую почву в плодородную, что позволяет им добиваться отличных результатов в сельском хозяйстве. Кроме того, они являются заботливыми семьянинами, и для них важны семья, стабильность и материальное благополучие."
        },
        {
          "id": 3,
          "zodiac_sign": "Близнецы",
          "description": "Нептун — это планета воображения и мечтаний. Она влияет на эмоциональную и духовную восприимчивость людей, освещая их творческие способности и связь с чем-то, что выходит за пределы материального мира.\n\nЛюди с Нептуном в Близнецах видят понимают, что в каждой молекуле, атоме и клетке заключено огромное количество информации, и умеют ее читать. Такие люди осознают, что интернет — лишь малая часть общего потока знаний. Они стремятся создать новую систему образования или способы передачи информации, направленные на расширение понимания и взаимосвязей в обществе."
        },
        {
          "id": 4,
          "zodiac_sign": "Рак",
          "description": "Нептун — это планета воображения и мечтаний. Она влияет на эмоциональную и духовную восприимчивость людей, освещая их творческие способности и связь с чем-то, что выходит за пределы материального мира.\n\nНептун в Раке является знаком экзальтации и раскрывает мощь этой планеты в полной мере. Люди с этой позицией — мистики, обладающие глубокой интуицией и способностями к искусству. Они могут быть талантливыми художниками, музыкантами, писателями или экстрасенсами. У них сильная связь с природой и космосом, а также с матерью и родиной. Они высоконравственны и готовы работать за еду, но могут испытывать трудности в практических делах, что делает их уязвимыми в повседневной жизни."
        },
        {
          "id": 5,
          "zodiac_sign": "Лев",
          "description": "Нептун — это планета воображения и мечтаний. Она влияет на эмоциональную и духовную восприимчивость людей, освещая их творческие способности и связь с чем-то, что выходит за пределы материального мира.\n\nЛюди с Нептуном во Льве представляют собой романтиков, способных приносить новые идеи и веяния. Они идеалисты в любви и творчестве, обладают предельно романтизированным взглядом на мир. Характеризуются жертвенностью и верностью, но часто дают завышенную оценку собственным чувствам, что приводит к страданиям. Взаимоотношения с детьми могут быть сложными: они часто требуют от них невозможного, что может стать причиной конфликтов. Если у них возникают трудности с детьми, они могут компенсировать это общением с внуками. Однако если отношения с детьми хорошие, то может возникнуть взаимное непонимание с внуками. Низкий духовный уровень у таких людей проявляется в преувеличенном мнении о себе, уязвимости и комплексах неполноценности, что ведет к деспотизму в любви и слепой привязанности к духовным вождям."
        },
        {
          "id": 6,
          "zodiac_sign": "Дева",
          "description": "Нептун — это планета воображения и мечтаний. Она влияет на эмоциональную и духовную восприимчивость людей, освещая их творческие способности и связь с чем-то, что выходит за пределы материального мира.\n\nНептун в Деве указывает на людей с избыточным доверием к формальной логике. Их творческое воображение может подавляться материальными обстоятельствами. Эти люди отличаются ограниченностью в чувствах и слабым развитием творческих способностей. Они способны находить гармонию и смысл в деталях, стремясь построить идеальную систему своих взглядов на жизнь. Такие люди ощущают высший долг и готовы пожертвовать всем ради своих идей. Однако избыточное доверие к научным фактам может вытеснять интерес к высшим духовным ценностям, что приводит к духовной инфантильности и мелочной брезгливости, мешающим видеть божественное происхождение мира."
        },
        {
          "id": 7,
          "zodiac_sign": "Весы",
          "description": "Нептун — это планета воображения и мечтаний. Она влияет на эмоциональную и духовную восприимчивость людей, освещая их творческие способности и связь с чем-то, что выходит за пределы материального мира.\n\nНептун в Весах символизирует поиск справедливости и стремление к социальной гармонии. Люди этого поколения ищут идеального партнера и душевное равновесие в общении с единомышленниками. При высоком уровне духовного развития они достигают глубокого взаимопонимания, но недостаточно развитые личности могут бездумно следовать общественным взглядам, проявляя консерватизм и неприязнь к реформам. Их способности к восстановлению утраченного равновесия могут выражаться в активной социальной деятельности и стремлении к улучшению общества."
        },
        {
          "id": 8,
          "zodiac_sign": "Скорпион",
          "description": "Нептун — это планета воображения и мечтаний. Она влияет на эмоциональную и духовную восприимчивость людей, освещая их творческие способности и связь с чем-то, что выходит за пределы материального мира.\n\nНептун в Скорпионе связан с перенапряжением чувств и духовным обновлением. Люди с этой позицией, достигшие высокого уровня развития, могут направлять свою сексуальную энергию в творческое русло, создавая новые формы искусства и исследуя оккультизм. Однако низкий уровень духовного развития может привести к увлечению запрещенными веществами и патологической сексуальной активности. Эта позиция стимулирует глубокие эмоциональные переживания и порождает новые формы самовыражения."
        },
        {
          "id": 9,
          "zodiac_sign": "Стрелец",
          "description": "Нептун — это планета воображения и мечтаний. Она влияет на эмоциональную и духовную восприимчивость людей, освещая их творческие способности и связь с чем-то, что выходит за пределы материального мира.\n\nЛюди с Нептуном в Стрельце обладают потребностью в высших духовных ценностях и интересом к религии. Натив стремится к обрядовой стороне веры и переменам в жизни. Высокий уровень развития дает ему альтруистичный взгляд на жизнь, но низкий уровень может привести к фанатизму и отсутствию связи с родиной. Такие люди ищут Бога внутри себя, и их духовные запросы становятся источником вдохновения. По мере взросления они начинают исследовать возможности человеческого разума, способствуя появлению мистики в обществе."
        },
        {
          "id": 10,
          "zodiac_sign": "Козерог",
          "description": "Нептун — это планета воображения и мечтаний. Она влияет на эмоциональную и духовную восприимчивость людей, освещая их творческие способности и связь с чем-то, что выходит за пределы материального мира.\n\nНептун в Козероге ассоциируется с распадом Советского Союза и последующими экономическими и политическими проблемами. Дети этого периода проявляют практический подход к реализации своих творческих возможностей, стремясь восстановить разрушенный порядок. Это поколение должно интегрировать свои духовные ценности в новую реальность и принимать на себя социальную ответственность. Они сталкиваются с необходимостью работать над исправлением последствий безответственной политики предыдущих поколений, что требует от них серьезного отношения к своей жизни."
        },
        {
          "id": 11,
          "zodiac_sign": "Водолей",
          "description": "Нептун — это планета воображения и мечтаний. Она влияет на эмоциональную и духовную восприимчивость людей, освещая их творческие способности и связь с чем-то, что выходит за пределы материального мира.\n\nНептун в Водолее знаменует начало Эры Водолея, когда поколение стремится создать новую цивилизацию, опираясь на гуманизм и достижения науки. Эти дети будут работать над созданием нового мирового порядка, основанного на единстве и братстве, и могут обладать интуицией и ясновидением. Их обостренное восприятие новизны способствует развитию спиритических способностей и глубокого понимания дружбы. Однако низкий уровень духовного развития может привести к авантюризму и отрицанию традиций."
        },
        {
          "id": 12,
          "zodiac_sign": "Рыбы",
          "description": "Нептун — это планета воображения и мечтаний. Она влияет на эмоциональную и духовную восприимчивость людей, освещая их творческие способности и связь с чем-то, что выходит за пределы материального мира.\n\nНептун в Рыбах предполагает появление нового поколения, которое станет двигателем духовного возрождения и принесет надежды Эры Водолея. Этот период характеризуется акцентом на нематериальные и духовные ценности, что может привести к новым культурным концепциям. Люди с Нептуном в Рыбах будут искать способы соединить духовное с материальным, создавая гармонию и способствуя трансформации общества."
        }
      ]
    },
    "Плутон": {
      "structure": {
        "columns": [
          "id",
          "zodiac_sign",
          "description"
        ],
        "total_records": 12
      },
      "data": [
        {
          "id": 1,
          "zodiac_sign": "Овен",
          "description": "Плутон — это планета силы и возрождения. Она отвечает за чувство контроля и личные изменения, а также помогает понять людям их теневую сторону.\n\nЛюди, у которых Плутон находится в Овне, проявляют неукротимое желание изменить мир вокруг себя раз и навсегда. Они не боятся вступать в конфликты и порой сами создают напряженные ситуации, когда считают это необходимым для достижения своих целей. Эта позиция Плутона излучает максимальную силу, иногда даже приближающуюся к безумию, что делает ее опасной. Эти индивидуумы готовы рисковать всем ради своих идеалов и не остановятся, пока не добьются желаемого результата."
        },
        {
          "id": 2,
          "zodiac_sign": "Телец",
          "description": "Плутон — это планета силы и возрождения. Она отвечает за чувство контроля и личные изменения, а также помогает понять людям их теневую сторону.\n\nЛюди с Плутоном в Тельце стремятся к стабильности и уверенности в материальном благополучии. Они ценят традиции своих предков и стараются следовать их мудрости. Их подход к жизни характеризуется терпением и смирением: они упорно работают и строят свое будущее, опираясь на проверенные временем знания и опыт. Это поколение заинтересовано в восстановлении забытых традиций земледелия, что позволяет им извлекать из природы максимум и добиваться впечатляющих результатов."
        },
        {
          "id": 3,
          "zodiac_sign": "Близнецы",
          "description": "Плутон — это планета силы и возрождения. Она отвечает за чувство контроля и личные изменения, а также помогает понять людям их теневую сторону.\n\nТе, у кого Плутон находится в Близнецах, активно стремятся изменить существующую систему образования и методы передачи информации. Они видят необходимость в преобразованиях, касающихся таких важных аспектов, как радио, газеты, телевидение и образовательные учреждения. Эти люди хотят создать более эффективные и доступные способы обучения, которые помогут каждому развить свои знания и навыки. Они верят, что информация — это ключ к улучшению общества."
        },
        {
          "id": 4,
          "zodiac_sign": "Рак",
          "description": "Плутон — это планета силы и возрождения. Она отвечает за чувство контроля и личные изменения, а также помогает понять людям их теневую сторону.\n\nЛюди с Плутоном в Раке имеют стремление улучшить окружающую их среду — свою родину, природу и систему образования, особенно в отношении детей. Это поколение активно участвует в таких общественных движениях и инициативах, как День защиты детей, а также в различных экологических проектах, включая Гринпис. Такие люди чувствуют глубокую связь с природой и стремятся защищать ее, внося изменения, которые сделают мир лучше для будущих поколений."
        },
        {
          "id": 5,
          "zodiac_sign": "Лев",
          "description": "Плутон — это планета силы и возрождения. Она отвечает за чувство контроля и личные изменения, а также помогает понять людям их теневую сторону.\n\nЛюди с Плутоном в Льве полны энергии и желания трансформировать все, что их окружает. Они стремятся привнести изменения в праздники, традиции и различные аспекты общественной жизни. Благодаря влиянию Льва, Плутон получает мощный импульс к действию, что позволяет нативам не только изменять, но и генерировать новые идеи. Эти индивидуумы уверены в своей силе и готовы вдохновлять других следовать за ними, создавая новые культурные практики и мероприятия."
        },
        {
          "id": 6,
          "zodiac_sign": "Дева",
          "description": "Плутон — это планета силы и возрождения. Она отвечает за чувство контроля и личные изменения, а также помогает понять людям их теневую сторону.\n\nЛюди с Плутоном в Деве стремятся внести изменения в научные исследования и их применение. Они хотят сделать знания более доступными и удобными для использования. Это поколение активно участвует в новых открытиях и научных изменениях, которые могут улучшить подходы к обучению и исследованию. Их внимание к деталям и стремление к совершенству делают их важными фигурами в научной сфере, способными изменить устоявшиеся парадигмы."
        },
        {
          "id": 7,
          "zodiac_sign": "Весы",
          "description": "Плутон — это планета силы и возрождения. Она отвечает за чувство контроля и личные изменения, а также помогает понять людям их теневую сторону.\n\nЛюди с Плутоном в Весах нацелены на изменение межличностных отношений, особенно в области романтики и супружеских связей. Они стремятся создать гармонию и красоту в отношениях, исследуя, как можно улучшить взаимодействие между партнерами. Эти индивидуумы понимают важность эмоций и стремятся к созданию глубоких и значимых связей, что делает их катализаторами перемен в социальной сфере."
        },
        {
          "id": 8,
          "zodiac_sign": "Скорпион",
          "description": "Плутон — это планета силы и возрождения. Она отвечает за чувство контроля и личные изменения, а также помогает понять людям их теневую сторону.\n\nЛюди с Плутоном в Скорпионе обладают сильным желанием трансформировать все, что связано с темой власти и сексуальности. Они становятся активными участниками сексуальной революции и могут вдохновлять других на изменения в этой сфере. Эти индивидуумы имеют много последователей, и их идеи о свободе и самовыражении в сексуальной жизни могут значительно повлиять на общественное мнение. Их страсть и энергия делают их настоящими новаторами."
        },
        {
          "id": 9,
          "zodiac_sign": "Стрелец",
          "description": "Плутон — это планета силы и возрождения. Она отвечает за чувство контроля и личные изменения, а также помогает понять людям их теневую сторону.\n\nЛюди с Плутоном в Стрельце выступают за нравственные и этические ценности. Они стремятся к тому, чтобы общество жило по правильным идеалам и правилам, подчеркивая важность нравственного поведения и духовного роста. Это поколение может вдохновлять других на поиск истины и справедливости, а их моральные принципы становятся основой для формирования здоровых отношений в обществе."
        },
        {
          "id": 10,
          "zodiac_sign": "Козерог",
          "description": "Плутон — это планета силы и возрождения. Она отвечает за чувство контроля и личные изменения, а также помогает понять людям их теневую сторону.\n\nЛюди с Плутоном в Козероге представляют собой трудоголиков, которые стремятся действовать в соответствии с высокими моральными стандартами. Они нацелены на реальные достижения и конструктивную работу, направленную на построение правильного и устойчивого мира. Это поколение понимает важность ответственности и готово работать над созданием лучших условий жизни для себя и окружающих. Их усилия могут изменить общественные структуры и принципы управления обществом."
        },
        {
          "id": 11,
          "zodiac_sign": "Водолей",
          "description": "Плутон — это планета силы и возрождения. Она отвечает за чувство контроля и личные изменения, а также помогает понять людям их теневую сторону.\n\nЛюди с Плутоном в Водолее обладают уникальной способностью создавать атмосферу дружелюбия и согласия среди разнообразных групп людей. Они стремятся к сотрудничеству и взаимопониманию, разрывая барьеры, которые разделяют людей. Эти индивидуумы вдохновляют других на совместные действия ради достижения общих целей, что делает их важными фигурами в обществе."
        },
        {
          "id": 12,
          "zodiac_sign": "Рыбы",
          "description": "Плутон — это планета силы и возрождения. Она отвечает за чувство контроля и личные изменения, а также помогает понять людям их теневую сторону.\n\nЛюди с Плутоном в Рыбах характеризуются высокой нравственностью и способностью влиять на представления о любви у окружающих. Они стремятся создавать новые идеалы отношений, вдохновляя других своим примером. Эти индивидуумы обладают способностью трогать сердца людей и открывать новые горизонты для понимания и выражения любви, что делает их важными деятелями в сфере эмоционального и духовного развития."
        }
      ]
    }
  },
  "zodiac_signs": [
    "Овен",
    "Телец",
    "Близнецы",
    "Рак",
    "Лев",
    "Дева",
    "Весы",
    "Скорпион",
    "Стрелец",
    "Козерог",
    "Водолей",
    "Рыбы"
  ],
  "planets": [
    "Солнце",
    "Асцендент",
    "Луна",
    "Меркурий",
    "Венера",
    "Марс",
    "Юпитер",
    "Сатурн",
    "Уран",
    "Нептун",
    "Плутон"
  ]
}